<?php include __DIR__ . "/header.php" ?>

<main>
    <p>
        Мы живем среди огромного разнообразия объектов: огромных планет и мельчайших частиц, живых организмов и
        искусственно созданных человеком устройств, отдельных индивидуумов и состоящих из них сообществ. Что же мы будем
        называть объектом? В философском смысле объект — это вещь, явление или процесс, на которые направлена
        познавательная деятельность субъекта, но мы будем использовать собственное определение, не привязанное к
        наблюдателю.
    </p>
    <p>
        Математика начинается с набора аксиом — положений, которые принимаются за истину без доказательств. Теорию
        объектов мы начнем с двух простых утверждений.
    </p>
    <p>
        Все известные материальные предметы состоят из более мелких частей. Наш организм состоит из клеток, клетки из
        белков, белки из аминокислот, аминокислоты из молекул, молекулы из атомов, атомы из протонов, нейтронов и
        электронов. Протоны и нейтроны состоят из кварков. Кварки, лептоны и калибровочные бозоны являются мельчайшими
        частицами материи, известными на данный момент. Пока мы не можем продолжить эту цепочку, но, вероятно, и они
        состоят из каких-то частей. Итак, первое утверждение заключается в том, что <b>каждый объект состоит из других
            более мелких объектов</b>, которые мы будем называть <b>внутренними частями</b>.
    </p>
    <p>
        Вторым очевидным утверждением является то, что все объекты изменяются. Изменение — это переход из одного
        состояния в другое в самом общем смысле. Изменения, вызванные внешними факторами, будем называть внешними
        воздействиями. Например, удар молотком по камню — внешнее воздействие на камень; захват сигнальной молекулы
        клеткой — внешнее воздействие на клетку; звонок по телефону — внешнее воздействие на человека.
    </p>
    <p>
        При каких же условиях несколько внутренних частей образуют новый объект? Для этого между ними должны
        существовать <b>связи</b>. Связи между частями существуют, если изменение одной из них вызывает изменения в других.
    </p>
    <img alt="" src="/images/1.1-1.jpg">
    <p>Итак, объект — это множество внутренних частей, между которыми существуют связи.</p>
    <p>
        Можно ли считать объектом два камня, лежащих на разных концах улицы? Между любыми физическими телами действует
        сила гравитации, однако если ударить по одному из камней, второй не ощутит никаких изменений в данных условиях.
        Если же их совместить, например, связать веревкой, они начнут сопротивляться удару вместе. Связанные камни уже
        могут считаться одним объектом.
    </p>
    <p>
        Важно отметить, что некоторые связи не существуют независимо от внешних воздействий. То, что является объектом
        относительно одного внешнего воздействия, может не иметь связей относительно другого. Например, кажется, что
        между отдельно стоящими деревьями не существует связей: если начать рубить одно дерево, другие не почувствуют
        никаких изменений. Однако, если в одном из деревьев поселится насекомое-вредитель и оставит потомство, то позже
        заразятся и остальные. По отношению к такому внешнему воздействию между деревьями существуют связи, и их
        множество — лес — может считаться объектом.
    </p>
    <p>
        Является ли объектом природный газ? Его молекулы не имеют прочных связей и легко меняют положение относительно
        друг друга, поэтому газ является слабым объектом относительно физических воздействий. Но если какое-то
        воздействие приведет к воспламенению небольшой его области, то огонь распространится и на остальные части. По
        отношению к возгоранию газ проявляет себя как объект.
    </p>
    <p>
        Также в качестве объекта можно рассмотреть компанию друзей. Если один из них попадет в аварию, остальные
        попытаются ему помочь: навестят в больнице, помогут деньгами, присмотрят за домашним животным. Коллектив
        реагирует на внешнее воздействие сообща, поэтому может считаться объектом.
    </p>
    <p>
        Посмотрим на примеры объектов различных типов, на их связи и на то, как они реагируют на различные внешние воздействия.
    </p>
    <blockquote>
        Когда будешь излагать науку, не забудь под каждым положением приводить его практические применения,
        чтобы твоя наука не была бесполезна.<br>
        — Леонардо Да Винчи
    </blockquote>
    <h3>Объект: планетарная система</h3>
    <p>
        Планетарные системы состоят из звезд, планет, спутников и других более мелких объектов. Связью между внутренними
        частями является сила гравитации.
    </p>
    <h3>Объект: твёрдое тело</h3>
    <p>
        Твердые тела состоят из молекул и атомов. Выделяют разные типы молекулярных связей: ионные, ковалентные,
        металлические, водородные. Реакция тел на физические внешние воздействия описывается классической механикой.
    </p>
    <h3>Объект: клетка</h3>
    <p>
        Клетка — минимальная единица жизни. Внутренние части дифференцированы, выполняют различные функции.
        Одноклеточные организмы способны реагировать на внешние биологические воздействия, например, на проникновение
        вируса.
    </p>
    <h3>Объект: человек</h3>
    <p>
        Человек — объект огромной сложности, который состоит из белков, клеток, органов, тканей, объединенных связями
        различных типов. Человек способен реагировать на большой спектр внешних воздействий: физических, биологических,
        информационных.
    </p>
    <h3>Объект: мозг</h3>
    <p>
        Мозг человека — сложнейший объект, который содержит миллиарды нейронов и выполняет важные жизненные функции. Для
        описания связей мозга или всей нервной системы существует специальный термин — «коннектом».
    </p>
    <h3>Объект: автомобиль</h3>
    <p>
        Автомобиль можно рассматривать совместно с водителем как один объект. Автомобиль без водителя — просто набор
        твердых тел и жидкостей, но вместе с водителем приобретает дополнительные свойства. Сам автомобиль никак не
        отреагирует на изменение — прокол колеса. Водитель же обратится в автосервис, и поломка будет устранена.
    </p>
    <h3>Объект: государство</h3>
    <p>
        Государство можно рассматривать как совокупность людей отдельно, так и вместе с транспортными средствами,
        зданиями, флорой, фауной, ландшафтом. Такой объект будет реагировать на вторжение другого государства или
        природную катастрофу.
    </p>
    <p>
        Существуют и более мелкие объекты-социумы: семья, поселение, город. Люди объединяются в такие объекты по
        определенному признаку: по национальности — в диаспоры, по месту рождения — в землячества, по профессии — в
        профсоюзы, по родственным связям — в семьи и кланы.
    </p>
    <blockquote>
        Общество — свод камней, который обрушился бы, если бы один не поддерживал другого.<br>
        — Сенека
    </blockquote>
    <p>
        Государства в свою очередь могут создавать межгосударственные объединения: союзы, блоки, торговые организации.
    </p>
    <h3>Объект: Североатлантический альянс (НАТО)</h3>
    <p>
        Блок НАТО представляет собой военно-политический союз стран Европы, США и Канады. Пятая статья устава НАТО
        практически повторяет определение объекта: <i>«договаривающиеся стороны соглашаются с тем, что вооруженное
            нападение на одну или несколько из них в Европе или Северной Америке будет рассматриваться как нападение на
            них в целом»</i>.
    </p>
    <p>В современной физике есть примеры необычных объектов.</p>
    <h3>Объект: запутанные частицы</h3>
    <p>
        Между квантово-запутанными частицами существует связь неизвестной природы. Экспериментально показано, что если
        провести измерение свойств одной из частиц, то это мгновенно повлияет на другую.
    </p>
    <p>
        Пока мы говорили о вещах, существующих в физическом пространстве, но можно привести пример и более абстрактных
        объектов. Посмотрим на план строительства дома.
    </p>

    <h3>Объект: план строительства дома</h3>
    <p>
        Такой объект состоит из нескольких частей: закладка фундамента, возведение стен и кровельные работы. Если в
        процессе строительства будут внесены изменения в фундамент, это может повлиять на стены, которые в свою очередь
        повлияют на крышу.
    </p>
    <p>
        Таким образом, цепочки связанных друг с другом событий являются объектами. Разумеется, такие объекты несколько
        отличаются от обычных, поскольку мы не умеем вносить изменения в события прошлого.
    </p>
    <p>
        Похожим образом объектом является любая область связанных друг с другом знаний. Каждое следующее открытие
        опирается на фундамент уже накопленной информации.
    </p>
    <blockquote>
        Если я видел дальше других, то потому, что стоял на плечах гигантов.<br>
        — Исаак Ньютон
    </blockquote>
    <p>
        При этом новые знания могут дополнять, уточнять, а иногда и полностью менять предыдущие.
    </p>
    <p>
        Компьютерные программы также представляют из себя объекты. Рассмотрим два типа изменений, которые могут с ними
        происходить.
    </p>
    <h3>Объект: программа во время исполнения</h3>
    <p>
        Во время исполнения код программы остается неизменным, а все изменения проходят в регистрах процессора и ячейках
        оперативной памяти. В более сложных случаях производится запись в постоянную память, с помощью чего можно
        организовать связи между разными запусками программы.
    </p>
    <p>
        Во втором случае изменяется сам код программы.
    </p>
    <h3>Объект: код программы</h3>
    <p>
        В процессе разработки программисты регулярно вносят изменения в код. Части программы могут быть связаны между
        собой, например, один модуль может использовать функции другого. В этом случае изменение одной части может
        потребовать изменения другой.
    </p>
    <p>
        Слишком сильные связи могут негативно отразиться на объекте-программе. В программировании это называется
        «сильным зацеплением» или «сильной связанностью».
    </p>
    <blockquote>
        Сильное зацепление рассматривается как серьезный недостаток, поскольку затрудняет понимание логики модулей, их
        модификацию, автономное тестирование, а также переиспользование по отдельности.<br>
        — Википедия
    </blockquote>
</main>