<?php include __DIR__ . "/header.php" ?>

<main>
    <p>
        В предыдущей главе мы говорили, что изменения, вызванные внешними факторами, называются внешними воздействиями.
        Кроме этого, внутренние части взаимодействуют между собой, также изменяя объект. Такие изменения мы будем
        называть действиями.
    </p>
    <img alt="" src="/images/1.2-1.jpg">
    <p><b>Внешнее воздействие</b> — изменение, вызванное внешними объектами.</p>
    <p><b>Действие</b> — изменение, вызванное взаимодействиями внутренних частей.</p>
    <h3>Объект: клетка</h3>
    <p>
        Действие: синтез новых белков.<br>
        Внешнее воздействие: проникновение вируса в клетку.
    </p>
    <h3>Объект: человек</h3>
    <p>
        Действие: умножение чисел в уме является действием с информацией.<br>
        Внешнее воздействие: любое получение информации извне, например, чтение этого текста.
    </p>
    <h3>Объект: государство</h3>
    <p>
        Действие: переезд людей из одной местности в другую внутри территории государства.<br>
        Внешнее воздействие: миграция людей из другого государства.
    </p>
    <h3>Объект: часы</h3>
    <p>
        Действие: взаимодействия внутренних частей изменяют положение стрелок, что позволяет внешнему наблюдателю
        определять время.<br>
        Внешнее воздействие: со временем действия часов теряют точность, и человеку приходится вмешиваться в работу
        механизма — заводить часы.
    </p>
    <p>Состояние, в котором окажется объект, определяется как самим внешним воздействием, так и последующими внутренними
        действиями.</p>
    <h3>Объект: государство</h3>
    <p>
        Все начинается с незначительного внешнего воздействия: перемещения носителя вируса на территорию государства.
        Передаваясь от человека к человеку, вирус заражает большое количество людей. С течением времени вырабатывается
        коллективный иммунитет, и пандемия сменяется сезонной заболеваемостью.
    </p>
    <p>В этом примере мы видим, как небольшое внешнее воздействие запускает цепочку действий, которые в результате
        оказывают огромное влияние на весь объект. Это означает, что результат зависит не только от внешнего
        воздействия, но и от внутреннего устройства, поэтому разные объекты имеют разную устойчивость к одинаковым
        внешним воздействиям.</p>
    <h3>Объект: камень</h3>
    <p>Легко расколоть ударом молота, но тяжело распилить болгаркой.</p>
    <h3>Объект: арматура</h3>
    <p>Легко распилить болгаркой, но тяжело разрушить с помощью молота.</p>
    <p>Это свойство можно сформулировать в виде принципа соответствия: чтобы добиться определенных изменений, необходимо
        оказать соответствующее внешнее воздействие.</p>
    <blockquote>
        Огонь заливают водой, от солнца укрываются зонтом, от болезни спасаются лекарством.<br>
        Изречение Древней Индии
    </blockquote>
    <p>Для решения различных математических задач используются разные методы, для ремонтных работ — разные инструменты, к каждому человеку требуется индивидуальный подход.</p>
</main>

