<?php include __DIR__ . "/header.php" ?>

<main>
    <p>Мы выяснили, что действия и внешние воздействия производят изменения. Множество возможных изменений определяет
        пространство, в котором находится объект.</p>
    <p><b>Пространство</b> — <i>множество возможных изменений объекта</i>.</p>
    <p>Множество внешних воздействий можно рассматривать отдельно как <b>внешнее пространство</b>.</p>

    <h2>Основные пространства</h2>

    <h3>Пространство фундаментальных взаимодействий</h3>
    <p>На самом низком уровне известны четыре основных типа взаимодействий: гравитационное, электромагнитное, сильное и
    слабое. Внешние воздействия оказываются с помощью частиц-переносчиков: фотонов, глюонов, W и Z бозонов. Сильное
        взаимодействие делает возможным существование атомных ядер.</p>
    <h3>Физическое пространство</h3>
    <p>Электромагнитные взаимодействия между молекулами и атомами формируют кристаллические решетки физических тел,
        взаимодействия которых описываются законами классической механики.</p>
    <h3>Химическое пространство</h3>
    <p>Электромагнитные взаимодействия также делают возможным существование различных конфигураций протонов, нейтронов и
    электронов — химических элементов. Взаимодействия между различными элементами описываются законами химии. В
        результате таких взаимодействий произошло образование органических веществ и первых одноклеточных организмов.</p>
    <h3>Пространство межклеточных взаимодействий</h3>
    <p>Около двух миллиардов лет назад взаимодействия между клетками позволили совершить переход от прокариот к эукариотам.
    Появление клеточного ядра связывают с поглощением одного одноклеточного организма другим. Позднее, около 500
    миллионов лет назад, произошел переход от одноклеточных организмов к многоклеточным. Примером взаимодействия между
        клетками в организме человека может служить передача нервного импульса от одного нейрона к другому.</p>
    <h3>Информационное пространство</h3>
    <p>Эволюция многоклеточных привела к появлению сложных объектов типа животных и людей. Подобные объекты могут оказывать
    друг на друга простые физические воздействия, но наибольший интерес представляют информационные воздействия, которые
    воспринимаются с помощью органов чувств: зрения и слуха. В результате таких взаимодействий образуются
        объекты-социумы.</p>

    <h2>Информационное пространство</h2>

    <p>С момента появления объектов высокого уровня возникает потребность в обмене информацией. Животные делают это с
        помощью положения тела, звуков и запахов. Человек использует более сложную систему письма и речи — язык.</p>
    <p>С развитием науки и техники в 19 веке были созданы новые средства связи, которые позволили быстро передавать
    информацию на большие расстояния. Появление радио, телевидения, телефонии и интернета преобразило информационное
        пространство и произвело революцию в экономике и социальной жизни людей.</p>
    <p>Виртуальное пространство интернета открывает дополнительные возможности: например, с помощью социальных сетей любой
    человек может быстро поделиться изображением или видео буквально с тысячами людей. В классическом информационном
        пространстве сделать такое практически невозможно.</p>
    <p>Виртуальное общение отличается от живого, поскольку во втором случае передается дополнительная информация в виде
    голоса, темпа речи, мимики, жестов и других невербальных воздействий. Переписка в интернете также несколько
    расширяет пространство общения, добавляя некоторые визуальные образы: картинки, смайлы, эмодзи, стикеры. При этом
    виртуальная анонимность позволяет собеседникам воздействовать друг на друга, не опасаясь физических воздействий, что
        облегчает применение речевой агрессии.</p>

    <h2>Подпространства</h2>

    <p>Пространства можно расширять, дополняя определенным набором воздействий или наоборот — сужать, запрещая часть
        воздействий, таким образом выделяя подпространства.</p>
    <p>Например, в общем информационном пространстве можно выделить подпространства звуков, вкусов, визуальных образов. Эти
        пространства, в свою очередь, также можно расширять или разбивать на более мелкие подпространства.</p>
    <h3>Видеоклип</h3>
    <p>Прослушивая музыкальный трек, человек испытывает исключительно звуковые воздействия. Видеоклип расширяет
        пространство звука, добавляя визуальную информацию.</p>
    <h3>Книга</h3>
    Читая книгу, человек находится в ее информационном пространстве. Отдельная глава или отрывок текста являются
    подпространством книги.

    <h2>Искусственные пространства</h2>

    <p>Люди создали множество искусственных подпространств, в которых действия и внешние воздействия осуществляются по
        установленным правилам. К таким пространствам относятся различные игры и виды спорта.</p>
    <p>В пространствах боевых искусств спортсмены оказывают ограниченные физические воздействия друг на друга.</p>
    <h3>Бокс</h3>
    <p>Внешними воздействиями являются исключительно удары руками.</p>
    <h3>Кикбоксинг</h3>
    <p>Кикбоксинг расширяет пространство бокса, добавляя удары ногами.</p>
    <h3>Смешанные единоборства</h3>
    <p>Пространство смешанных единоборств использует более широкий спектр воздействий, чем классические единоборства.
        Бойцы применяют различные ударные техники, броски, болевые и удушающие приемы.</p>
    <p>В таких командных видах спорта как футбол, баскетбол, волейбол, хоккей действиями и внешними воздействиями
        являются перемещения игроков и работа со специальным объектом — мячом или шайбой.</p>
    <p>В более абстрактных игровых пространствах: настольных, карточных и компьютерных играх для воздействий на
        противников используются фигуры, карты, фишки, джойстики, виртуальные персонажи.</p>
    <h3>Морской бой</h3>
    <p>Единственное действие — расстановка кораблей — совершается перед началом игры. Затем игроки поочередно оказывают
        внешние воздействия на поле противника, пытаясь уничтожить вражеские корабли.</p>
    <h3>Шахматы</h3>
    <p>Каждый ход игроки совершают действие — изменяют положение одной из своих фигур. Взятие фигуры противника является
    внешним воздействием. Кроме того, игроки видят ходы друг друга, что является получением информации, а значит, и
        внешним воздействием.</p>
    <h3>Покер</h3>
    <p>Пространство покера включает в себя действия с деньгами и картами, а также использует элементы психологии. Своим
        поведением игроки демонстрируют силу карт, оказывая друг на друга информационные воздействия.</p>
    <p>В некоторых соревновательных пространствах используется объект-посредник, над совершенствованием которого постоянно
        ведется работа.</p>
    <h3>Гонки</h3>
    <p>В гоночных видах спорта помимо мастерства водителя имеет значение работа над автомобилем, посредством которого
        спортсмены соревнуются друг с другом.</p>
    <h3>Роботы</h3>
    <p>В битвах роботов игроки управляют специальным объектом-роботом, который с помощью физических воздействий наносит
        урон противнику.</p>
    <p>Существует огромное количество компьютерных игр, каждая из которых представляет собой определенное пространство.
        Выделяют различные жанры игровых пространств: стратегии, шутеры, файтинги, симуляторы, ролевые игры и другие.
        Многие
        карточные и настольные игры организованы в виртуальном пространстве.</p>
    <p>Можно по-разному относиться к пространствам компьютерных игр, однако их современное разнообразие в сочетании с
        доступностью становится поистине угрожающим. В 2019 году Всемирная организация здравоохранения внесла игровую
        зависимость в перечень заболеваний. По статистике количество часов, которые люди проводят в виртуальных игровых
        пространствах исчисляется миллиардами.</p>

    <h2>Физическое, торговое, информационное пространства</h2>

    <p>Особое внимание стоит уделить тройке пространств: физическому, торговому и информационному.</p>
    <p>Обмен ценностями осуществляется в <b>торговом</b> пространстве. Внешними воздействиями являются сделки между
        участниками
        рынка. Технически торговля может быть организована в физическом или виртуальном пространстве.</p>
    <p>В некоторых играх условно выделяют роли воина, торговца и мудреца. Каждая из этих ролей соответствует
        определенному пространству. Воин успешен в физическом пространстве, торговец — в торговом, а мудрец может быть успешен в любом
        подпространстве, где происходит обмен информацией.</p>
    <blockquote>
        Разуму нужны книги, как мечу нужен точильный камень, если он хочет сохранить остроту.<br>
        — Джордж Мартин, «Игра престолов»
    </blockquote>
    <p>Грубые информационные воздействия подобно физическим могут нанести человеку травму.</p>
    <blockquote>
        Язык — самое опасное оружие: рана от меча легче залечивается, чем от слова.<br>
        — Кальдерон де ла Барка
    </blockquote>
    <p>Особый интерес представляет противостояние между объектами-государствами в этих трех пространствах. Реальные
        боевые действия часто сопровождаются торговыми войнами. Например, потерпев поражение от английского флота в
        Трафальгарском сражении, Наполеон развернул континентальную экономическую блокаду Англии.</p>
    <p>Физическое пространство взаимодействий между государствами меняется со временем. До появления огнестрельного
        оружия кочевники представляли серьезную угрозу для земледельцев. После появления огнестрельного оружия военное
        преимущество перешло к технологически развитым странам, где народы, как правило, имели четко выраженную территорию оседлости.
        Изобретение атомной бомбы в 20-м веке во многом изменило ситуацию. Страны, обладающие ядерным оружием,
        предпочитают вести прокси-войны и избегать прямого столкновения друг с другом. Конфликты XXI века показали важность
        высокотехнологичных средств поражения, таких как дроны, одновременно обесценив значение тяжелой военной техники —
        кораблей и танков.</p>
    <p>С появлением телевидения и интернета борьба в информационном пространстве приобрела новую силу. Если раньше она
        ограничивалась вербовкой агентов и разбрасыванием листовок над позициями врага, то в настоящее время — переместилась
        в социальные сети и средства массовой информации. Хотя информационные воздействия и не позволяют уничтожать
        живую силу и технику, они способны оказывать влияние на умы миллионов людей и заставлять их действовать определенным
        образом.</p>

    <h2>Другие пространства</h2>

    <p>Водитель автомобиля находится в пространстве дорожного движения, в котором определены специальные информационные
        воздействия. Например, правила обязывают показывать поворотниками направление движения. Также для воздействия на
        других водителей используют дальний свет, звуковой сигнал, аварийную сигнализацию.</p>
    <p>Еще одно производное пространство — юридическое. Когда водитель составляет с инспектором ГАИ протокол, они
        взаимодействуют в юридическом пространстве. Внешними воздействиями являются установленные юридические процедуры:
        штраф, арест имущества, лишение свободы, которые могут быть организованы в торговом или физическом пространстве.</p>
    <p>Термин «пространство» часто встречается в математике. Некоторые математические пространства можно описать на
        языке объектов.</p>

    <h3>Векторное пространство</h3>
    <p>Рассмотрим объекты, с которыми можно производить изменения: складывать с другими объектами и умножать на числа.
        Если в результате этих операций получаются объекты такого же типа, и эти операции подчиняются определенным аксиомам,
        то перед нами важная математическая структура — линейное или векторное пространство. Объекты такого пространства
        называются векторами.</p>

    <p>Люди пытаются уйти от несправедливых взаимодействий физического и торгового пространств в особые духовные
        пространства. Существует большое разнообразие таких пространств — от канонических религий до различных
        эзотерических практик. Считается, что в этих пространствах объекты высокого уровня продолжают существовать после смерти.</p>
</main>

