<?php include __DIR__ . "/header.php" ?>

<main>
    <p>
        Если посмотреть на объекты низкого уровня, то можно заметить, что они состоят в основном из похожих внутренних
        частей. Например, кристаллические решетки твердых тел содержат множество одинаковых молекул и атомов,
        соединенных химическими связями. У объектов высокого уровня внутренние части более дифференцированы и могут брать на себя
        функцию управления. Внутренние части, воздействия которых имеют подавляющую силу, будем называть управляющими
        элементами.
    </p>
    <img alt="" src="/images/1.4-1.jpg">
    <p>
        Простым примером управления являются движения человека. Мозг передает сигналы в виде электрических импульсов по
        цепочке нейронов к мотонейронам, которые в свою очередь воздействуют на мышцы, приводя их в движение.
    </p>
    <p>Управлением примитивного типа можно считать простые физические воздействия.</p>
    <h3>Объект: солнечная система</h3>
    <p>Солнце — основной управляющий элемент солнечной системы, который, оказывая воздействия на остальные планеты,
        заставляет их двигаться по орбитам.</p>
    <p>Начиная с клеток, у объектов высокого уровня появляются более сложные управляющие элементы.</p>
    <h3>Объект: клетка</h3>
    <p>Рибосома — молекулярная машина, которая управляет синтезом белка в клетке. Воздействуя на аминокислоты, она
        выстраивает их в порядке, соответствующем молекуле РНК, создавая новые белки.</p>
    <h3>Объект: коммерческая компания</h3>
    <p>Руководитель отдела коммерческой компании своим присутствием оказывает информационное воздействие на
        подчиненных, повышая их производительность. При необходимости он может прибегнуть и к более грубым воздействиям: замечаниям,
        штрафам, а в крайнем случае — увольнению.</p>
    <h3>Объект: государство</h3>
    <p>Функция управления в демократических государствах распределена между тремя ветвями власти: законодательной,
        исполнительной и судебной. Законодательная власть работает над определением правил, на основании которых
        исполнительные и судебные органы оказывают воздействия на внутренние части.</p>
    <p>Как мы видим, управляющие элементы применяют разнообразные физические, химические, биологические, информационные
        воздействия. Если в них и удается выделить что-то общее, то оно носит условный характер. Но все же рассмотрим
        несколько похожих функций, присущих управляющим элементам различных объектов.
    </p>

    <h2>Опорная функция</h2>

    <p>Опорная функция реализуется с помощью физических воздействий. Она позволяет объекту и его частям сохранять
        определенное положение в пространстве.</p>
    <h3>Объект: клетка</h3>
    <p>Опорную функцию в клетке выполняет цитоскелет, состоящий из филаментов и микротрубочек. Цитоскелет позволяет
        клетке сохранять форму и перемещаться в пространстве.</p>
    <h3>Объект: человек</h3>
    <p>Основой опорно-двигательного аппарата человека являются мышцы и кости. Мышцы, получая сигналы от мозга, с
        помощью физических воздействий перемещают и удерживают кости в определенном положении.</p>
    <h3>Объект: государство</h3>
    <p>
        В государстве опорная функция не так явно выражена, как у клетки или человека. Государство практически
        неподвижно в пространстве, а его положение определяется территорией, границы которой защищают вооруженные силы.
    </p>

    <h2>Транспортная функция</h2>

    <p>Транспортная функция заключается в перемещении внутренних частей из одной точки в другую.</p>
    <h3>Объект: клетка</h3>
    <p>Перемещение молекул внутри клетки осуществляется с помощью везикул и специальных транспортных белков.</p>
    <h3>Объект: человек</h3>
    <p>Гемоглобин с помощью химического воздействия связывает кислород и переносит его к клеткам.</p>
    <h3>Объект: государство</h3>
    <p>В государстве роль транспорта выполняют автомобили, корабли, самолеты и прочие транспортные средства.</p>

    <h2>Защитная функция</h2>

    <p>Каждый объект высокого уровня стремится защититься от разрушительных изменений. Для этого существуют специальные
        механизмы, которые реализуют защитную функцию.</p>
    <h3>Объект: клетка</h3>
    <p>Одноклеточные организмы уничтожают вирусы с помощью системы рестрикции-модификации и механизма CRISPR-Cas.</p>
    <h3>Объект: человек</h3>
    <p>В организме человека защитную функцию выполняют клетки иммунитета. С помощью специфических воздействий они
        способны запоминать, выявлять и уничтожать враждебные для организма элементы.</p>
    <h3>Объект: государство</h3>
    <p>Защитную функцию государства выполняют вооруженные силы, спецслужбы, правоохранительные органы.</p>
    <p>Слишком сильная защитная функция может негативно отразиться на объекте. В случае клетки и человека иммунитет
        начинает уничтожать нормальные внутренние части, а государство применяет излишне репрессивные меры.</p>
</main>

