<?php include __DIR__ . "/header.php" ?>

<main>
    <p>
        Во второй главе отмечено, что результат внешнего воздействия определяется как самим воздействием, так и
        действиями объекта. Рассмотрим более детально некоторые внутренние процессы, которые происходят внутри объекта в ответ на
        внешние воздействия.
    </p>

    <h2>Адаптация</h2>

    <p>Процесс адаптации можно разделить на несколько этапов.</p>
    <img alt="" src="/images/1.5-1.jpg">
    <p>
        1. Объект находится в некотором состоянии.<br>
        2. Внешнее воздействие (или действие) изменяет состояние объекта.<br>
        3. Действия объекта направлены на то, чтобы восстановить прежнее состояние.<br>
        4. Дополнительные действия объекта направлены на то, чтобы сделать объект более устойчивым к повторному внешнему
        воздействию.<br>
    </p>
    <p>
        Максимально адаптированное состояние, при котором внешние воздействия производят минимальные изменения, будем
        называть состоянием равновесия или точкой равновесия по отношению к этому воздействию. Важно отметить, что даже
        в точке равновесия внешнее воздействие изменяет состояние объекта (2), однако это не вызывает дополнительных
        адаптационных действий (4).
    </p>
    <h3>Объект: клетка</h3>
    <p>При повреждении внутренних частей клетки (2) запускаются процессы регенерации (3), гипертрофии и гиперплазии
        (4). Происходит активация ряда генов, влияющих на синтез белков, восстанавливаются поврежденные органеллы,
        увеличивается размер клетки.</p>
    <h3>Объект: человек</h3>
    <p>
        В процессе выполнения физических упражнений мышцы теряют энергию и получают микротравмы (2). Организм расщепляет
        глюкозу, восстанавливая запасы энергии в мышцах и возвращает их в рабочее состояние (3). В течение нескольких
        дней после тренировки действия организма направлены на гипертрофию — увеличение массы и объема мышц (4).
    </p>
    <h3>Объект: государство</h3>
    <p>
        Во время Второй мировой войны Советскому Союзу был нанесен огромный экономический урон (2). План восстановления
        народного хозяйства назывался «четвертой пятилеткой» и включал в себя процессы (3) и (4).
    </p>

    <blockquote>
        Основная задача нового пятилетнего плана состоит в том, чтобы восстановить пострадавшие районы страны,
        восстановить довоенный уровень промышленности и сельского хозяйства и затем превзойти этот уровень в более или менее
        значительных размерах.<br>
        — И. В. Сталин
    </blockquote>

    <p>Необходимо отметить важность внутренних действий для процесса адаптации. В некоторых ситуациях специальное
        внешнее воздействие может оказать помощь, однако, чтобы закрепить улучшения, должна быть проделана самостоятельная
        работа.</p>

    <h3>Объект: человек. Пространство: шахматное</h3>
    <p>
        Шахматист может воспользоваться помощью компьютера, чтобы сделать сильный ход, однако, без самостоятельного
        анализа это не приведет к повышению уровня игры. Необходимо понять, почему именно этот ход — сильнейший в данной
        позиции.
    </p>

    <h3>Объект: человек. Пространство: физическое</h3>
    <p>
        Профессиональные спортсмены прибегают к помощи фармакологии, чтобы увеличить силовые показатели. После
        прекращения приема стимулирующих препаратов организм восстанавливает естественный гормональный фон. Это явление известно как
        феномен отката.
    </p>
    <h3>Объект: человек. Пространство: торговое</h3>
    <p>
        Предприниматель, легко получивший большие деньги, не способен эффективно ими управлять, в отличие от того, кто
        создал бизнес самостоятельно.
    </p>

    <h2>Колебания</h2>

    <p>Мы выяснили, что в процессе адаптации действия объекта возвращают его в прежнее состояние. Если этот процесс
        протекает слишком активно, в работу включаются противодействующие силы и начинаются колебания.</p>
    <img alt="" src="/images/1.5-2.jpg">
    <blockquote>
        Чтобы выпрямить, надо перегнуть. Не перегнешь — не выпрямишь.<br>
        — Мао Цзэдун
    </blockquote>

    <h3>Объект: пружинный маятник</h3>
    <p>
        Примером простых колебаний является знакомый из школьной физики пружинный маятник. Растяжение пружины
        увеличивает силу сопротивления, груз начинает замедляться, а затем двигаться обратно. В данном случае колебания называются
        гармоническими и хорошо описываются уравнениями.
    </p>
    <p>
        Колебания могут быть вызваны как внутренними факторами, так и внешними. Например, математический маятник
        представляет собой груз, висящий на конце стержня. В отличие от пружинного маятника, он возвращается в точку
        равновесия внешним воздействием — силой тяготения.
    </p>
    <h3>Объект: человек</h3>
    <p>
        Повышение уровня сахара в крови служит сигналом к синтезу инсулина. Инсулин увеличивает проницаемость клеточных
        мембран, и глюкоза начинает поступать в клетки. Если этот процесс проходит слишком активно, человек рискует
        попасть в состояние с пониженным уровнем сахара — гипогликемию. В этом состоянии в работу включается другой гормон —
        глюкагон, который заставляет клетки печени выделять глюкозу в кровоток, повышая уровень сахара. Весь этот
        процесс называется гомеостазом глюкозы. Организм человека имеет множество похожих систем, которые поддерживают
        постоянство внутренних свойств.
    </p>
    <h3>Объект: государство</h3>
    <p>
        Центральный банк в государстве регулирует эмиссию денежных средств с помощью ставки рефинансирования. Слишком
        низкая или слишком высокая ставка вызывает разбалансировку экономических показателей — увеличение инфляции или
        стагнацию. Центральный банк стремится найти оптимальные показатели и изменяет ставку, вызывая ее колебания.
    </p>

    <h2>Изменение внешнего пространства</h2>

    <p>Изменение внешних воздействий вызывает новые адаптационные процессы.</p>
    <img alt="" src="/images/1.5-3.jpg">
    <p>Слишком резкие изменения могут нанести объекту необратимые повреждения. Чтобы избежать этого, необходимо
        постепенно увеличивать силу внешних воздействий, запуская процессы адаптации.</p>

    <blockquote>
        То, что не убивает, делает нас сильнее.<br>
        — Фридрих Ницше
    </blockquote>

    <h3>Объект: человек. Пространство: физическое</h3>
    <p>
        Мышцы спортсменов адаптируются к физическим нагрузкам, и вызвать их рост становится все труднее и труднее. Чтобы
        ускорить прогресс, опытные спортсмены пытаются изменить характер внешних воздействий: сократить отдых между
        подходами, изменить амплитуду движения, увеличить интенсивность. При этом слишком тяжелая нагрузка или
        недостаточный отдых могут привести к травме.
    </p>

    <h3>Объект: человек. Пространство: торговое</h3>
    <p>
        Человек планирует бюджет, исходя из своего месячного дохода. Резкое ухудшение финансового положения может
        негативно отразиться на здоровье и даже довести до самоубийства. Например, в кризис 2009 года из-за больших финансовых
        потерь покончил с собой один из богатейших людей Германии — Адольф Меркле.
    </p>
    <h3>Объект: человек. Пространство: юридическое</h3>
    <p>
        В 2021 году в связи с эпидемией COVID-19 были введены новые правила посещения общественных мест. Попасть в кафе,
        торговые центры, кинотеатры стало возможным только предъявив QR-код, который свидетельствовал о наличии
        прививки. Такое изменение правил в сторону дополнительных ограничений вызвало недовольство общества и даже привело к
        проведению митингов.
    </p>
    <h3>Объект: человек. Пространство: информационное</h3>
    <p>
        Начало военных действий резко меняет информационное пространство и подвергает человека сильному стрессу.
        Средства массовой информации заполняются новостями о боевых действиях, разрушениях и жертвах среди мирного населения.
        Через некоторое время человек адаптируется, и подобная информация перестает вызывать шок.
    </p>

    <blockquote>
        Любая война популярна в течение первых тридцати дней.<br>
        — Артур Шлезингер
    </blockquote>

    <h3>Объект: человек. Пространство: игровое</h3>
    <p>
        В соревновательных компьютерных играх устанавливается баланс между элементами игры, который определяет силу
        внешних воздействий, являясь точкой равновесия для каждого игрока. С каждым обновлением разработчики пытаются
        сбалансировать игру — усиливают слабых персонажей и ослабляют сильных. На некоторое время игроки попадают в новое внешнее
        пространство и адаптируются к нему, пока не установится новая точка равновесия, которую на игровом сленге
        называют «мета».
    </p>
    <p>
        В отличие от компьютерных игр, сила шахматных фигур не меняется столетиями. Достаточно поменять местами
        несколько фигур в начальной позиции, и сотни дебютов, книг с разборами партий окажутся бесполезными. Это происходит в
        шахматах Фишера, где начальная расстановка определяется случайным образом. Несмотря на постоянство правил, шахматная
        теория продолжает развиваться. С появлением сильных компьютерных программ многие дебюты были переосмыслены, а игроки
        высокого уровня продолжают адаптироваться к новой теории.
    </p>

    <h3>Объект: армия. Пространство: физическое</h3>
    <p>
        Хорошая армия умеет адаптироваться к изменениям на поле боя, например, к применению новых технических средств.
        Новым оружием первой мировой войны стали боевые отравляющие вещества. Военным приходилось изобретать новые защитные
        средства, что привело к появлению первых противогазов.
    </p>
    <p>
        Чередование процессов адаптации и изменений внешнего пространства является ключом к эволюции объектов. Сначала
        новичок в тренажерном зале поднимает штангу минимального веса, затем постепенно увеличивает нагрузку. Похожие
        процессы происходили с биологическими видами. Миллионы лет назад жизнь выбралась из воды на сушу. Оказавшись в
        новых условиях, морские животные адаптировались и приобрели новые свойства. Продолжающийся миллионы лет эволюционный
        процесс привел к появлению объектов высокого уровня: людей и состоящих из них социумов.
    </p>
</main>

