<?php include __DIR__ . "/header.php" ?>

<main>
    <p>
        В первой части мы говорили об устройстве объектов и происходящих с ними изменениях в результате действий и
        внешних воздействий. Теперь посмотрим на процесс взаимодействия нескольких объектов, который состоит из этапов получения
        информации, преобразования информации и действий, переходящих в направленные воздействия.
    </p>
    <p>
        Рассмотрим в качестве примера игру в теннис. Движение мяча оказывает визуальное воздействие (1) на игрока.
        Обрабатывая информацию, мозг вычисляет траекторию (2) и определяет, какие действия нужно совершить, чтобы
        направить мяч на сторону противника. Мозг отправляет сигналы мышцам, игрок перемещается в пространстве (3) и наносит удар
        ракеткой, перебрасывая мяч через сетку, оказывая, в свою очередь, внешнее воздействие на противника (4). Процесс
        (1-2-3-4) повторяется для второго игрока.
    </p>
    <img alt="" src="/images/2.1-1.jpg">
    <p>
        1. Внешнее воздействие передает объекту информацию (глава 2.2.)<br>
        2. Объект преобразовывает информацию (глава 2.3.)<br>
        3. На основании информации объект совершает действие (глава 2.4.)<br>
        4. Действие превращается в направленное внешнее воздействие на другой объект (глава 2.5.)<br>
    </p>
    <p>
        День человека наполнен множеством подобных взаимодействий. Просыпаясь, мы получаем информацию от будильника.
        Оказывая направленные воздействия на чайник с кружкой, завариваем кофе, который вызывает определенные действия
        организма и помогает проснуться. На протяжении дня нас сопровождают телефонные разговоры, покупки в магазинах,
        рабочие взаимодействия с коллегами. Вечером мы идем в бар с друзьями, чтобы с помощью информационных
        взаимодействий обсудить новости.
    </p>
    <p>
        Взаимодействия могут быть более простыми или сложными, например, состоять из одного цикла 1-2-3-4 или из
        нескольких. Посмотрим на некоторые примеры.
    </p>

    <h3>Объект: калькулятор</h3>
    <p>
        Чтобы выполнить арифметическую операцию, человек передает информацию с помощью нажатия кнопок (1). Калькулятор
        совершает запрограммированные действия (2,3) и выдает ответ на экране (4).
    </p>

    <h3>Объект: шахматист</h3>
    <p>
        Каждый ход противника дает шахматисту новую информацию (1). Игрок просчитывает возможные варианты (2) и делает
        свой ход (3), оказывая ответное направленное воздействие (4).
    </p>

    <h3>Объект: армия</h3>
    <p>
        Артиллерийское подразделение получает от разведки данные о местоположении противника (1,2). С помощью действий
        военнослужащих с системами залпового огня (3) на данный участок оказывается огневое воздействие (4).
    </p>

    <p>
        В совершении действий участвуют как врожденные механизмы, так и приобретенные в течение жизни. В случае человека
        и животных первые называются безусловными рефлексами, а вторые — условными рефлексами.
    </p>
    <p>
        Способность анализировать информацию дает объектам возможность выбора из нескольких вариантов действий (глава
        2.6). Понимая, к какому результату приводят направленные воздействия, объекты высокого уровня вступают в конкурентную
        борьбу (глава 2.7).
    </p>

</main>

