<?php include __DIR__ . "/header.php" ?>

<main>
    <p>
        Когда вы читаете эту книгу, миллиарды фотонов оказывают внешние воздействия на рецепторы глаз. Световая энергия
        трансформируется в нервный импульс и передается в мозг, где в виде нейронных связей сохраняется содержание
        текста.
        Так внешние воздействия передают объектам информацию.
    </p>
    <img alt="" src="/images/2.2-1.jpg">
    <p>
        Что же такое информация? Существует множество определений этого понятия. Будем говорить, что информация — это
        определённое состояние внутренних частей и связей, представляющее собой знания объекта о внешнем мире. Возникает
        вопрос: какие внешние воздействия передают информацию, а какие — нет? Чтобы на него ответить, рассмотрим
        следующие
        примеры:
    </p>
    <h3>Объект: камень</h3>
    <p>Камень, сталкиваясь с другим объектом изменяет скорость.</p>
    <p>
        Можно сказать, что скорость твердого тела — это информация о последнем внешнем воздействии, однако такая
        «память» краткосрочна и утрачивается сразу же после следующего взаимодействия.
    </p>
    <h3>Объект: камень</h3>
    <p>Под внешним воздействием скульптора камень приобретает форму внешности человека.</p>
    <p>
        В отличие от предыдущего примера информация сохраняется на долгое время, но требует специального внешнего
        воздействия. Это подводит нас к мысли, что получение информации зависит не столько от внешних воздействий,
        сколько
        от наличия внутренних механизмов, способных воспринимать широкий спектр воздействий. Другими словами, внешние
        воздействия должны запустить цепочку действий, которые приведут к сохранению информации.
    </p>
    <h3>Объект: бактерия</h3>
    <p>
        Одноклеточные организмы способны запоминать воздействие вирусов с помощью механизма CRISPR/Cas, который
        сохраняет в
        геноме часть инородной ДНК.
    </p>
    <h3>Объект: человек</h3>
    <p>
        Основными способами получения информации человеком являются слух и зрение, которые превращают внешние физические
        воздействия в информацию.
    </p>
    <h3>Объект: государство</h3>
    <p>
        Государство получает информацию с помощью разведки, дипломатии, СМИ, интернета, технических средств
        наблюдения.
    </p>

    <h2>Интерфейсы</h2>

    <p>
        Если объект воспринимает лишь ограниченный спектр внешних воздействий, то набор таких воздействий будем называть
        интерфейсом. Например, если ударить по калькулятору палкой, это вызовет в нем некоторые изменения, но нас
        интересуют
        такие воздействия, которые заставят его произвести математическую операцию. Для этого необходимо нажать на
        кнопки в
        определенном порядке. Таким образом, клавиатура калькулятора представляет собой интерфейс для взаимодействия с
        ним.
    </p>
    <h3>Объект: человек. Интерфейс: язык</h3>
    <p>
        Простейшим примером интерфейса является язык. Чтобы англоговорящий человек получил информацию, необходимо
        использовать воздействия, которые передают слова на английском языке.
    </p>
    <h3>Объект: человек. Интерфейс: этикет</h3>
    <p>
        В ресторанном этикете существуют специальные положения столовых приборов, с помощью которых можно передать
        официанту
        информацию. Однако, если попытаться использовать язык этикета в обычном кафе, вероятно, это не сработает.
    </p>
    <h3>Объект: компьютер. Интерфейс: веб-сайт</h3>
    <p>
        Сайт является интерфейсом для взаимодействия с серверной частью. С помощью интерактивных элементов: ссылок,
        кнопок и
        форм пользователи отправляют информацию на сервер.
    </p>
    <h3>Объект: объект в программировании. Интерфейс: программный интерфейс</h3>
    <p>
        Программный интерфейс является абстракцией, используемой в объектно-ориентированном программировании. Интерфейс
        гарантирует внешним пользователям, что объект имеет определенные методы, с помощью вызова которых можно
        взаимодействовать с ним.
    </p>
    <h3>Объект: компьютер. Интерфейс: сетевой протокол</h3>
    <p>
        Обмен информацией между двумя компьютерами происходит с помощью протокола TCP/IP, который определяет, в каком
        формате должны быть представлены пакеты данных.
    </p>
</main>

