<?php include __DIR__ . "/header.php" ?>

<main>
    <p>В предыдущей главе мы выяснили, что объекты получают и сохраняют информацию в своих внутренних частях и связях,
        которые по определению изменяются действиями. Это неизбежно приводит к тому, что в процессе эволюции объекты
        приобретают возможность преобразовывать информацию.</p>
    <img alt="" src="/images/2.3-1.jpg">

    <p>Если яблоко упадет на камень, то последний всего лишь ощутит физическое воздействие. Человек же сделает вывод,
        что под яблонями нужно ходить аккуратнее. История науки знает и более существенные преобразования информации,
        вызванные падением яблока на голову человека.</p>

    <h3>Объект: клетка</h3>
    <p>Примером преобразования информации клеткой можно считать сплайсинг — вырезание определенных последовательностей
        нуклеотидов из молекулы РНК.</p>

    <h3>Объект: животное</h3>
    <p>Некоторые животные обладают способностью превращать визуальную информацию в знания о своем теле. Эта способность
        определяется с помощью теста, разработанного в 1970 году психологом Гордоном Гэллапом. На тело животного
        наносится метка. Если животное поворачивается, чтобы разглядеть незнакомое пятно, то понимает, что краска
        находится на собственном теле. Зеркальный тест проходят обезьяны, слоны, сороки, дельфины и некоторые другие
        животные.</p>

    <p>Особенностью объектов-социумов является способность передавать информацию между своими частями и совершать
        коллективные преобразования информации, достигая таким образом научного прогресса.</p>

    <h3>Объект: научное сообщество</h3>
    <p>В течение многих веков люди накапливали знания о других планетах. Первые письменные упоминания о солнечной
        системе относятся к 15 веку до н. э. В вавилонской планетарной теории были получены измерения движения планет. В
        средние века была предложена гелиоцентрическая система. Расцвет телескопических наблюдений пришёлся на конец XIX
        — середину XX века, когда были составлены подробные карты поверхности некоторых планет. С 1960-х годов
        исследования проводят с помощью межпланетных космических станций.</p>

    <p>Нужно отметить, что в данном примере, кроме преобразований информации, происходит создание более совершенных
        технических средств наблюдения, которые помогают получать новую информацию. Таких результатов было бы невозможно
        добиться без участия огромного количества ученых из самых разных эпох. Это же можно сказать про любую научную
        область знаний.</p>

    <h2>Ум</h2>
    <p>Люди часто наделяют других качеством ума, но часто ли мы задумываемся, что вообще значит слово «умный»? Википедия
        дает такое определение:</p>

    <blockquote>Ум — это совокупность способностей к мышлению, познанию, пониманию, восприятию, запоминанию, обобщению, оценке и
        принятию решения кем-либо.</blockquote>

    <p>В этом определении присутствуют термины, которые в свою очередь требуют пояснений. Попробуем, основываясь на
        преобразовании человеком информации, дать более простое, емкое определение. Для этого посмотрим на следующие
        примеры:</p>

    <h3>Решение математических задач</h3>
    <p>Решая простую школьную задачу, ученик читает условие, составляет уравнение и решает его, преобразуя начальную
        информацию в ответ. Иногда требуются более сложные преобразования, например, в доказательствах теорем.</p>

    <h3>Анализ литературного произведения</h3>
    <p>Анализ литературного произведения несколько отличается от решения математических задач. В этом случае исходная
        информация представлена не в такой строгой форме как в точных науках, но все же не лишена логических связей.
        Результатом должно стать сочинение — информация, созданная на основе текста произведения.</p>

    <h3>Расследование преступлений</h3>
    <p>Примерами умных людей всегда служили сыщики. В процессе расследований из информации, собранной с места
        преступления, они получают информацию о преступнике.</p>

    <h3>Предсказания</h3>
    <p>Особенностью объектов высокого уровня является способность выстраивать причинно-следственные связи и
        предсказывать события будущего.</p>

    <blockquote>Быть мудрым — значит не только видеть то, что под ногами, но и предвидеть будущее. — Теренций</blockquote>

    <h3>Эмоциональный интеллект</h3>
    <p>Получая вербальную и невербальную (мимика, голос, жесты) информацию, человек может понимать эмоции других людей.
        Эта способность называется эмоциональным интеллектом.</p>

    <p>Эмоциональный интеллект — сумма навыков и способностей человека распознавать эмоции, понимать намерения,
        мотивацию и желания других людей, и свои собственные. — Википедия</p>

    <h3>Творчество</h3>
    <p>Являются ли сочинение стихов или музыки проявлением ума? В творческих процессах участвует упомянутый выше
        эмоциональный интеллект. Комбинируя различные элементы, поэты и художники создают новую информацию и оценивают
        эмоции, которые вызывает получившийся результат.</p>

    <p>Обобщая рассмотренные примеры, можно сказать: <b>ум — это способность объектов качественно преобразовывать
            информацию.</b></p>

    <p>В это короткое и емкое определение укладывается и строгое логическое мышление, и эмоциональный интеллект. Слово
        «качественно» означает, что полученная информация достоверно описывает внешние объекты и позволяет
        взаимодействовать с ними.</p>

    <p>Зачастую люди совершают ошибки в преобразованиях информации, например, находят связи там, где их нет на самом
        деле. Проявлениями излишней связности являются идеи о тайных знаках, мировых заговорах, несуществующих секретных
        группировках. Таким образом, умный человек понимает, какие связи существуют, а какие — нет.</p>

    <p>Наличие большого объема информации еще не гарантирует умение ее обрабатывать. Другими словами: эрудированный — не
        значит умный.</p>

    <blockquote>Мудр не тот, кто знает многое, а тот, чьи знания полезны. — Эсхил</blockquote>

    <p>Однако, тот, кто обладает большими знаниями, вероятно умнее, поскольку получение новой информации также тренирует
        и ее обработку.</p>

    <h3>О компьютерах</h3>
    <p>Говоря о преобразованиях информации, нельзя не сказать о компьютерах. Компьютер — это умный объект, созданный
        человеком, который помогает нам выполнять различные преобразования информации. Машины уже научились обрабатывать
        изображения, аудио, видео, играть в игры, анализировать большие объемы данных. Пока еще компьютер не способен
        выполнять такой же спектр действий с информацией, на которые способен человек, однако, если найден алгоритм,
        машина выполняет работу более эффективно. В математических вычислениях компьютеры давно стали незаменимыми
        помощниками, пройдя путь от простейших калькуляторов до современных суперкомпьютеров.</p>

    <p>В 21 веке машины научились обыгрывать человека в сложные логические игры, хотя еще в середине прошлого века такое
        не представлялось возможным. В 1996 году компьютер впервые обыграл в шахматы чемпиона мира Гарри Каспарова. За
        последние десятилетия компьютерные алгоритмы научились играть на порядок лучше любого гроссмейстера и стали
        неотъемлемой частью подготовки людей к соревнованиям.</p>

    <p>В конце 2022 года компания OpenAI представила общественности чат-бота ChatGPT, который умеет отвечать на вопросы,
        переводить тексты и писать код. В настоящее время искусственный интеллект активно учится создавать изображения,
        видео, писать музыку, программировать и решать сложные технические задачи.</p>

    <p>Отличие ума от объема информации можно проиллюстрировать аналогией между человеком и компьютером. Объем знаний
        компьютера — это информация, записанная на жестком диске, а ум — это процессор и видеокарта, то есть, те части,
        которые занимаются преобразованиями информации. Слабый компьютер не сможет воспроизвести современную видеоигру
        также, как недостаточно умный человек не способен заниматься наукой. С другой стороны, если не скачать игру на
        диск, то мощный процессор останется без дела также, как и умный человек, который не занимается интеллектуальной
        деятельностью.</p>

    <blockquote>Мало иметь хороший ум, главное — хорошо его применять. — Декарт</blockquote>

    <p>В заключение подчеркнем преимущества преобразования информации на примере интерпретируемых и компилируемых языков
        программирования. В случае интерпретируемых языков код программы превращается в команды процессора прямо во
        время ее запуска. В компилируемых языках происходит дополнительное преобразование высокоуровневых инструкций в
        машинный код, которое увеличивает скорость работы программы.</p>
</main>

