<?php include __DIR__ . "/header.php" ?>

<main>
    <p>В предыдущих главах шла речь о том, как объекты получают и преобразовывают информацию. Теперь посмотрим, как
        информация используется для совершения действий.</p>
    <img alt="" src="/images/2.4-1.jpg">

    <h3>Объект: клетка</h3>
    <p>Клетки используют последовательность нуклеотидов из РНК как информацию для синтеза белка.</p>

    <h3>Объект: человек</h3>
    <p>Световая информация, получаемая человеком, влияет на действия организма, связанные с биологическими ритмами.
        Попадая на сетчатку глаза, свет передает сигнал эпифизу, который подавляет выработку мелатонина — гормона,
        отвечающего за режимы сна и бодрствования.</p>

    <h3>Объект: государство</h3>
    <p>Если государство получает разведданные, что около границы возрастает количество войск потенциального противника,
        то совершает действия, направленные на предотвращение возможной агрессии — перемещает свои войска.</p>

    <p>В некоторых случаях предоставленная объекту информация может привести к действиям, имеющим негативные
        последствия.</p>

    <h3>Объект: клетка</h3>
    <p>Вирусы подменяют родное ДНК клетки. В результате клетка синтезирует молекулы вируса, что может нарушить ее работу
        и привести к гибели.</p>

    <h3>Объект: компьютерная программа</h3>
    <p>Программе отправляется специальным образом подготовленная информация, производя действия с которой, выполняются
        недопустимые операции. Например, SQL инъекция — одна из уязвимостей сайтов, основанная на некорректной обработке
        информации, введенной злоумышленником.</p>

    <h3>Объект: человек</h3>
    <p>В некоторых случаях пациенту не сообщают о тяжелом диагнозе, поскольку такая информация может привести к
        ухудшению здоровья.</p>

    <blockquote>Некоторые болезни следует лечить, не рассказывая о них больному. Многие умерли оттого, что узнали, чем
            больны.<br>— Сенека</blockquote>

    <p>Похожим приемом пользуются злоумышленники, когда сообщают человеку о случившейся беде с родственником. При
        поступлении такой информации некоторые люди теряют способность критически мыслить и совершают необходимые
        мошенникам действия.</p>

    <p>Цепочку «информация — действие» можно использовать и в обратном направлении, то есть, по действиям делать выводы
        об имеющейся информации. В карточных играх так можно узнать о картах противника. Например, если игрок должен
        положить карту определенной масти, но при этом он долго думает, вероятно, что у него таких карт несколько.</p>

    <p>Похожая логика используется в решении задачи про трех мудрецов: <i>Трем мудрецам показали пять колпаков: три черных
        и два белых. Затем им завязали глаза и надели всем троим по черному колпаку. После этого с них сняли повязки и
        предложили каждому, посмотрев друг на друга, определить, какого цвета колпак на нём. Через некоторое время один
            из мудрецов догадался, что на нём чёрный колпак. Как он рассуждал?</i></p>

    <p>Решение основано на логической цепочке, которая приводит мудрецов к выводу, что если бы на собственной голове был
        белый колпак, то эта информация вызвала бы действия других. Поскольку такие действия не совершаются, то и
        информация не верна.</p>

</main>