<?php include __DIR__ . "/header.php" ?>
<main>
    <p>В предыдущих главах рассматривалось, как объекты получают информацию, преобразовывают ее и совершают действия.
        Теперь посмотрим, как внутренние действия превращаются во внешние воздействия на другие объекты.</p>
    <img alt="" src="/images/2.5-1.jpg">

    <p>В результате действий происходит разрыв связей, и от объекта отделяются части, которые оказывают воздействия на
        другие объекты.</p>

    <p>В период становления физики существовали две теории: дальнодействия и близкодействия. Теория дальнодействия
        говорила, что объекты воздействуют друг на друга без посредников. Теория близкодействия, принятая на сегодняшний
        день, говорит, что объекты создают вокруг себя поля, которые можно рассматривать как поток частиц-переносчиков
        взаимодействий.</p>

    <h3>Объект: заряженная частица</h3>
    <p>Заряженная частица оказывает воздействие на другие электрические заряды. В современной физике считается, что
        данное взаимодействие осуществляется путем обмена фотонами.</p>

    <p>Частицы создают вокруг себя симметричные поля и не имеют никакой информации о внешних объектах, что говорит о
        ненаправленности таких воздействий.</p>

    <h2>Направленные воздействия</h2>
    <p>Идея направленных воздействий заключается в наличии информации, на основании которой объекты высокого уровня
        оказывают воздействия на внешние объекты.</p>

    <p><b>Направленное воздействие</b> — воздействие на внешний объект на основании информации о нем.</p>
    <img alt="" src="/images/2.5-2.jpg">

    <p>Направленные воздействия не обязательно связаны с направлением в пространстве. Например, когда мама зовет сына в
        толпе людей, звук распространяется во всех направлениях, но только ребенок должным образом отреагирует на голос
        мамы и свое имя.</p>

    <p>Наглядной иллюстрацией различия между направленным и ненаправленным воздействием может служить падение яблока на
        голову человека. В одном случае, когда яблоко бросает с балкона хулиган-школьник, мы имеем дело с направленным
        воздействием; в другом, когда фрукт просто падает с ветки дерева — с ненаправленным.</p>

    <p>В административном и уголовном законодательстве различают различные степени направленности воздействия: прямой и
        косвенный умысел.</p>

    <p>Воздействие может быть направлено как на один конкретный объект, так и на целую группу. Например, когда артист
        выступает на сцене, его воздействия направлены на всех зрителей, сидящих в зале.</p>

    <p>Примитивным проявлением направленного воздействия является реакция физического тела на столкновение.</p>

    <h3>Объект: физическое тело</h3>
    <p>По третьему закону Ньютона, испытав воздействие со стороны внешнего объекта, тело оказывает ответное физическое
        воздействие равное по силе и противоположное по направлению.</p>

    <p>Примитивность такого воздействия заключается в отсутствии процесса преобразования информации. Механизмы,
        созданные человеком, могут оказывать более сложные направленные воздействия.</p>

    <h3>Объект: мышеловка</h3>
    <p>Механическое воздействие на пусковой механизм превращается в направленное воздействие: рычаг наносит удар в
        область присутствия жертвы.</p>

    <p>Некоторые естественные объекты действуют похожим образом.</p>

    <h3>Объект: растение</h3>
    <p>Пузырчатка представляет собой хищное растение, которое питается мелкими животными. Дотрагиваясь до чувствительных
        волосков, жертва запускает цепочку действий, которые приводят к направленному воздействию — затягиванию жертвы
        внутрь ловушки.</p>

    <p>Определенные клетки могут иметь информацию для оказания направленных воздействий.</p>

    <h3>Объект: клетка</h3>
    <p>Т-лимфоциты являются клетками иммунитета человека. Организм производит большое количество таких клеток, и каждая
        несет в себе информацию об определенном антигене. При обнаружении антигена у другой клетки лимфоцит оказывает
        разрушающее направленное воздействие.</p>

    <p>Объекты высокого уровня могут использовать направленные физические воздействия, например, когда хищник охотится
        за жертвой или два боксера дерутся на ринге. Однако основной интерес во взаимодействиях животных и людей
        представляет передача информации с помощью воздействий на органы чувств.</p>

    <h3>Объект: животное</h3>
    <p>Самцы некоторых видов птиц для привлечения внимания самок исполняют причудливые танцы. Для общения дельфины
        используют сложную систему звуков. Многие животные помечают территорию специальными запахами, воздействуя, таким
        образом, на соперников.</p>

    <p>Объекты высокого уровня могут оказывать сложные направленные воздействия, которые состоят из цепочек
        взаимодействий.</p>
    <img alt="" src="/images/2.5-3.jpg">

    <p>Примером таких воздействий является использование животными орудий труда.</p>

    <h3>Объект: животное</h3>
    <p>Обезьяны открывают орехи, разбивая их камнями; птицы используют ветки, чтобы достать пищу из небольших отверстий;
        муравьи обрезают листья и используют их в качестве емкостей для транспортировки еды и воды.</p>

    <p>С помощью сложных технических средств люди способны оказывать информационные воздействия на большом
        расстоянии.</p>

    <h3>Объект: человек</h3>
    <p>Говоря по телефону, человек совершает ряд действий, которые превращаются в направленные воздействия. Движения
        легких создают струю воздуха, которая проходит через голосовые связки. Затем в работу подключаются губы и язык,
        в результате чего создается звуковая волна, которая превращается в серию электрических импульсов и по проводам
        доставляется в трубку телефона другого человека.</p>
</main>
