<?php include __DIR__ . "/header.php" ?>

<main>
    <p>Преобразование информации открывает объектам высокого уровня важную способность — рассматривать несколько
        различных вариантов действий. Набор возможных действий будем называть <b>множеством действий</b>. Во многих случаях,
        когда мы говорим о действиях, то также подразумеваем и следующие из них воздействия на внешние объекты или даже
        цепочки взаимодействий.</p>
    <img alt="" src="/images/2.6-1.jpg">

    <p>Если человек хочет выпить кофе из автомата, множество его действий будет состоять из вариантов: эспрессо, латте,
        капучино, и т. д. Во многих случаях множество действий также включает вариант бездействия, например, он может
        передумать пить кофе или в списке не окажется желаемого.</p>

    <p>Законы движения твердых тел не допускают никакого множества действий, однако в классической механике существует
        принцип наименьшего действия, который говорит, что если рассмотреть самые разные траектории движения, и каждой
        из них поставить в соответствие некоторую величину S (действие), то из всех траекторий тело выберет такую, для
        которой S имеет минимальное значение. Здесь мы всего лишь подчеркиваем сходство в терминологии, понимая, что
        объекты низкого уровня не умеют преобразовывать информацию и рассматривать различные варианты действий.</p>

    <p>Посмотрим на примеры множеств действий объектов более высокого уровня.</p>

    <h3>Объект: животное</h3>
    <p>В поле зрения хищника попадает травоядное животное. Хищник оценивает состояние жертвы, рельеф местности,
        расстояние и прочие факторы. Множество действий: догонять добычу или не тратить силы.</p>

    <h3>Объект: человек</h3>
    <p>Чтобы открыть бутылку вина, обычно используют штопор. Если же он отсутствует, может потребоваться другое
        воздействие на пробку. Множество действий: выбить снизу, протолкнуть внутрь, подогреть зажигалкой, или в крайнем
        случае открыть «по-гусарски».</p>

    <h3>Объект: шахматист</h3>
    <p>В шахматной партии после первого хода белых: 1.e4 для ответа у черных есть 20 возможных ходов: e5, d5, e6, ….
        Некоторые варианты практически не играются, в каких-то у игрока слабая дебютная подготовка. Если известно, что
        противник хорошо играет сицилианскую защиту, вариант 2…c5 будет отброшен. В итоге множество действий сокращается
        до нескольких ходов.</p>

    <h3>Объект: игрок в покер</h3>
    <p>Множество действий игрока в покер состоит из трех действий: fold, check/call, raise (сбросить карты, уровнять
        ставку, повысить ставку).</p>

    <h3>Объект: государство</h3>
    <p>Среди государственных политиков есть сторонники более дипломатичных методов (голуби) и более жестких (ястребы). В
        этом внутреннем противостоянии определяется, какие воздействия государство будет использовать в своей внешней
        политике.</p>

    <h2>Развилки</h2>
    <p>Кроме простых действий объекты высокого уровня участвуют в длинных цепочках взаимодействий, растянутых во
        времени. Например, чтобы поднять штангу большого веса, нужно провести множество тренировок, каждая из которых
        состоит из серии взаимодействий со штангой.</p>

    <p>В условиях ограничения времени часто встает вопрос — выбрать цепочку действий, ведущую к одной цели или к
        нескольким?</p>
    <img alt="" src="/images/2.6-2.jpg">

    <p>Заниматься одним видом спорта или пробовать разные? Иметь глубокие знания в одной конкретной области или общую
        эрудицию? Ответы на эти вопросы зависят от свойств самого объекта, а также внешних условий. Рассмотрим плюсы и
        минусы обоих подходов на примере анализа шахматной позиции.</p>

    <p>Расчет начинается с нескольких вариантов первого хода. Если не рассмотреть все варианты, можно пропустить самую
        сильную линию. Начинающие шахматисты часто бросаются просчитывать глубоко один из вариантов и упускают из
        внимания более сильный первый ход. Минус выбора одного варианта в том, что есть риск упустить более выгодный
        путь.</p>

    <p>Если же анализировать варианты слишком долго, то не останется времени на более глубокий расчет. Минус выбора
        многих вариантов в том, что остается меньше времени на проработку одной линии.</p>

    <p>Обычно оптимальная стратегия состоит в том, чтобы потратить часть времени на оценку всех вариантов, выбрать
        несколько лучших, а затем работать над каждым из них.</p>

    <h3>Объект: человек</h3>
    <p>Если отдать ребенка во множество разных секций, его энергии не хватит на достижение успеха ни в каком конкретном
        виде спорта. С другой стороны, если не выявить талант, есть риск упустить его призвание. Чтобы решить эту
        проблему, следует обратиться к опытному тренеру, который способен определить, стоит ли ребенку заниматься данным
        видом спорта.</p>

    <p>Другим примером могут служить военные действия армии.</p>

    <h3>Объект: армия</h3>
    <p>Если использовать все силы для удара в одном направлении, есть риск потерпеть поражение, поскольку атакующая
        сторона тратит больше ресурсов, чем защищающаяся. Для решения этой проблемы проводится разведка боем на
        нескольких направлениях. В те места, где выявлены слабости в обороне, перебрасываются дополнительные силы.</p>

    <h2>Оценка выбора</h2>
    <p>В жизни мы часто сталкиваемся с оценкой выбора. Каждый человек периодически совершает неудачные действия:
        политики принимают неверные решения, финансисты заключают невыгодные сделки, шахматисты делают плохие ходы.
        Важно понимать, что выбор действия основан на имеющейся информации, а значит, необходимо владеть именно теми
        знаниями, которыми руководствовался человек при совершении действия. Если совершенное действие кажется плохим,
        следует предложить другое из множества действий.</p>

    <blockquote>Мало сказать: не делай так. Надо еще прибавить: вот так делай.<br>— М. Горький</blockquote>

    <p>В некоторых ситуациях все возможные действия приводят к негативным последствиям, и в этом случае хороший выбор —
        это выбор меньшего из зол.</p>

    <blockquote>Из двух зол выбирай меньшее.<br>— Аристотель</blockquote>

    <p>В шахматах существуют позиции, в которых любой ход ведет к поражению (цугцванг). Во многих других случаях
        существует ход, который позволяет свести партию вничью. Задача хорошего игрока — находить такие ходы.</p>

    <p>Чтобы принимать правильные решения, важно уметь рассматривать все варианты и оценивать плюсы и минусы каждого
        действия. Этот крайне полезный навык используется в карточных, компьютерных, настольных играх, да и во многих
        жизненных ситуациях.</p>
</main>