<?php include __DIR__ . "/header.php" ?>

<main>
    <p>Мы рассмотрели в деталях процесс получения объектом информации, ее преобразования и выбора действий, переходящих
        в направленные воздействия. Когда несколько объектов с помощью направленных воздействий пытаются добиться
        противоречащих друг другу изменений, возникает конкуренция.</p>
    <img alt="" src="/images/2.7-1.jpg">

    <p>Целью конкуренции может являться определенное состояние внешних объектов или собственное состояние.</p>

    <p>Примитивной формой конкуренции можно считать ненаправленные физические воздействия.</p>

    <h3>Объекты: звезды</h3>
    <p>Массивные космические тела затягивают более мелкие планеты в свое гравитационное поле. Победителя в этой
        конкуренции определяют массы звезд, расстояния, а также расположение других небесных тел.</p>

    <p>Объекты типа клеток и растений используют похожие примитивные формы конкуренции.</p>

    <h3>Объекты: растения</h3>
    <p>Растения конкурируют друг с другом за расположение корней в почве. Деревья с развитой корневой системой мешают
        более слабым растениям получать питательные вещества.</p>

    <p>Объекты типа животных и человека совершили качественный скачок в конкуренции, поскольку они обладают большей
        подвижностью и интеллектом. Мы рассмотрим несколько видов конкуренции, но отметим, что такая классификация носит
        весьма условный характер, поскольку часто встречаются смешанные формы.</p>

    <h2>Прямая конкуренция</h2>
    <p>Прямая конкуренция возникает, когда целью является непосредственно один из конкурентов.</p>
    <img alt="" src="/images/2.7-2.jpg">

    <h3>Объекты: животные</h3>
    <p>Черепахи используют панцирь как защиту от нападения хищников. Умные птицы поднимают черепах и сбрасывают с
        большой высоты, разбивая панцирь о камни.</p>

    <h3>Объекты: люди</h3>
    <p>Боксеры с помощью ограниченных физических воздействий пытаются нанести друг другу урон и заставить прекратить
        бой.</p>

    <h3>Объекты: люди</h3>
    <p>Люди вступают в споры друг с другом, пытаясь заставить собеседника согласиться со своей точкой зрения.</p>

    <h2>Сравнение</h2>
    <p>Сравнение — это важный для объектов высокого уровня вид конкуренции в информационном пространстве. Она возникает,
        когда несколько объектов ставят цель опередить друг друга по некоторым показателям.</p>

    <h3>Объекты: люди</h3>
    <p>В соревнованиях по плаванию каждый спортсмен двигается по своей дорожке, не оказывая прямых воздействий на
        соперников. Победителем становится тот, кто достигнет финиша за меньшее время.</p>

    <p>Многие виды спорта, такие как легкая и тяжелая атлетика, силовые виды спорта, различные виды стрельб, танцы — все
        они организованы с помощью сравнения.</p>

    <h3>Объекты: люди</h3>
    <p>Блогеры соревнуются друг с другом за количество подписчиков в соцсетях.</p>

    <h3>Объекты: государства</h3>
    <p>На олимпиадах страны конкурируют за общее количество медалей.</p>

    <p>Этот вид конкуренции является продуктом информационного пространства. Люди любят соревноваться в сравнении самых
        разных показателей. С помощью сравнения организованы многие популярные развлекательные шоу на телевидении:
        «КВН», «Голос», «Русский ниндзя», «Своя игра», «Битва шефов», «4 свадьбы» и многие другие.</p>

    <h2>Конкуренция за ресурсы</h2>
    <p>Объекты высокого уровня могут конкурировать за ресурсы — еду, деньги, территорию, недвижимость и другие
        материальные ценности.</p>
    <img alt="" src="/images/2.7-3.jpg">

    <h3>Объекты: животные</h3>
    <p>Хищные птицы не только ловят рыбу сами, но и отнимают ее у сородичей.</p>

    <h3>Объекты: люди</h3>
    <p>Участники аукциона взаимодействуют в торговом пространстве, пытаясь приобрести выставленный лот. Игроки
        поочередно озвучивают свои предложения, оказывая направленные воздействия на аукциониста. Победителем становится
        тот, кто готов заплатить максимальную цену.</p>

    <h3>Объекты: государства</h3>
    <p>Государства конкурируют за рынки сбыта, то есть за возможность импортировать свои товары.</p>

    <h2>Конкуренция за информацию</h2>
    <p>С помощью информационных воздействий можно привлекать других на свою сторону и добиваться от них участия в
        определенных взаимодействиях.</p>
    <img alt="" src="/images/2.7-4.jpg">

    <h3>Объекты: животные</h3>
    <p>Чтобы добиться внимания самки, самцы некоторых видов птиц исполняют причудливые танцы.</p>

    <h3>Объекты: ученые</h3>
    <p>Накопленные знания доступны всему научному сообществу, поэтому некое, уже следующее открытие, могут совершить
        сразу несколько ученых. В этом случае между ними может вестись конкуренция за признание первооткрывателем.
        Например, спор за вклад в дифференциальное исчисление между Ньютоном и Лейбницем продолжался более ста лет и
        даже привел к разрыву связей между английской и европейской научными школами.</p>

    <h3>Объекты: люди</h3>
    <p>Во многих играх можно стать свидетелем перекладывания ответственности, когда команда терпит поражение. Игроки
        пытаются снять с себя вину, предъявляя претензии другим, пытаясь таким образом повысить свою репутацию. Похожую
        ситуацию можно наблюдать внутри многих объектов-социумов: семье, городе, стране.</p>

    <h2>Конкуренция за положение в обществе</h2>
    <p>Объекты высокого уровня понимают, как устроены взаимодействия в обществе, и пытаются занять в нем высокое
        положение. Это открывает дополнительные возможности для получения ресурсов и выгодных взаимодействий.</p>
    <img alt="" src="/images/2.7-5.jpg">

    <blockquote>Везде, где находил я живое, находил я и волю к власти; и даже в воле служащего находил я волю быть
        господином.<br>— Ф. Ницше</blockquote>

    <h3>Объекты: животные</h3>
    <p>В стае животных разворачивается борьба за доминирующее положение. Важную роль в этой конкуренции играют размеры
        животного, физическая сила, уровень агрессивности.</p>

    <h3>Объекты: люди</h3>
    <p>При приеме на работу компании рассматривают большое количество соискателей. Чтобы иметь преимущество в такой
        конкуренции, кроме реальных знаний необходимо иметь хорошее резюме, портфолио, рекомендации с предыдущих мест
        работы.</p>

    <h3>Объекты: люди</h3>
    <p>Когда уходит сильный лидер, за его место ведется конкуренция, которая может сопровождаться созданием новых
        группировок, интригами, и даже переместиться в физическое пространство. Например, в СССР после смерти Сталина в
        1953 году началось противостояние между Берией, Маленковым и Хрущевым. В результате внутрипартийной борьбы Берия
        был арестован в июне 1953 года, а затем расстрелян. Конкуренция между Хрущевым и Маленковым продолжалась еще
        несколько лет и закончилась победой Хрущева.</p>

    <h2>Переход между пространствами</h2>
    <p>Из предыдущей главы мы знаем, что объекты делают выбор из множества действий. Это означает, что они могут
        выбирать пространство для конкуренции.</p>

    <blockquote>Говори лишь о том, что знаешь.<br>Китайская поговорка</blockquote>

    <p>Если человек видит, что проигрывает конкуренцию в одном пространстве, то может попытаться перейти в другое. В
        большинстве случаев переход между пространствами — это попытка поставить себя в более выгодное положение.</p>

    <p>В главе 1.3 мы говорили о важной тройке пространств: информационном, торговом и физическом. Посмотрим на примеры
        переходов между этими пространствами.</p>

    <h3>Объект: человек</h3>
    <p>Когда ребенок хочет заполучить игрушку товарища, у него есть разные пути решения этой задачи. Для начала можно
        вежливо попросить (информационное пространство). В случае отказа попробовать купить или обменять на другую
        игрушку (торговое пространство). И в крайней случае — отобрать силой (физическое пространство).</p>

    <h3>Объект: государство</h3>
    <p>Если одному государству не удается воздействовать на другое дипломатическими методами или угрозами
        (информационное пространство), оно может применить экономические санкции (торговое пространство). Если же и эти
        воздействия не приносят результат, то ситуация может дойти до вооруженного столкновения (физическое
        пространство).</p>

    <h3>Объект: компания</h3>
    <p>Если в финансовом споре (торговое пространство) сторонам не удается договориться, то конфликт приходится решать
        через суд (юридическое пространство).</p>

    <p>Кроме переходов между пространствами, люди активно используют критику других пространств. Например, известный
        промышленник Генри Форд, преуспевающий в торговом пространстве, критиковал физическую активность: <i>«Гимнастика
            — это полная чушь. Здоровым она не нужна, а больным противопоказана»</i>.</p>

    <p>А так известный футболист Александр Мостовой отозвался о победе российских киберспортсменов: <i>«Это не настоящий
            спорт. Там ничего не надо делать: ни бегать, ни прыгать. Сиди, да руками играй за компьютером»</i>.</p>

    <p>Многократный олимпийский чемпион по борьбе Александр Карелин не считает полноценным видом спорта смешанные боевые
        единоборства: <i>«Мы пытаемся воспринимать это как вид спорта. Это система проведения соревнований»</i>.</p>
</main>