<?php include __DIR__ . "/header.php" ?>

<main>
    <p>Изучая мифологии разных цивилизаций, можно заметить, что зачастую богов олицетворяют существа, имеющие
        человеческий или животный облик. Другой подход заключается в том, что высшие сущности представляют собой
        абстрактные противоположности, похожие на инь и янь.</p>

    <blockquote>В процессе развития китайской философии ян и инь все более символизировали взаимодействие крайних
        противоположностей: света и тьмы, дня и ночи, солнца и луны, неба и земли, жары и холода, положительного и
        отрицательного, чётного и нечётного.<br>— Википедия</blockquote>

    <p>О противоположностях рассуждали философы самых разных времен.</p>

    <blockquote>Самая фундаментальная экзистенциальная дихотомия — это дихотомия между жизнью и смертью.<br>— Эрих Фромм</blockquote>

    <p>Один из законов диалектики, описанный Энгельсом, говорит: «Противоположности — это такие стороны, которые всегда
        исключают друг друга, дополняют друг друга и находятся в неразрывном единстве».</p>

    <p>Психолог Карл Густав Юнг предполагал, что человеческие психозы являются следствием столкновения
        противоположностей, одна из которых проявляется в сознании, а другая скрывается в области бессознательного.</p>

    <p>Опираясь на теорию объектов, попытаемся составить пары противоположностей и понять, в каких отношениях они
        находятся.</p>

    <h2>Внешнее — Внутреннее</h2>
    <p>Противоположность «внешнее — внутреннее» возникает естественным образом из определения объекта. Изменения,
        вызванные внешними факторами, мы назвали внешними воздействиями, а внутренними — действиями.</p>

    <p>Рассмотрев процессы взаимодействий, можно сказать, что объекты низкого уровня сосредоточены в основном на
        внутренних действиях и почти не способны оказывать направленные воздействия вовне. В отличие от них объекты
        высокого уровня активно изучают окружающий мир, получая и обрабатывая информацию. Человек достиг в этом огромных
        успехов, заглянув как в мельчайшие частицы материи, так и в далекие галактики.</p>

    <h2>Часть — Целое (глава 3.2)</h2>
    <p>Противоположность «часть — целое» также естественно возникает из определения объекта как набора внутренних
        частей.</p>

    <h2>Теория — Практика (глава 3.3)</h2>
    <p>Противоположность «теория — практика» порождается способностью объектов преобразовывать информацию. Теория — это
        информация, хранящаяся во внутренних связях объекта. В качестве практики могут выступать действия, направленные
        воздействия, а также устройство и взаимодействие внешних объектов.</p>

    <h2>Свобода — Несвобода (глава 3.4)</h2>
    <p>Противоположность «свобода — несвобода» порождается множеством действий объекта. Чем больше у объекта вариантов
        действий, тем больше у него свободы.</p>

    <h2>Донор — Акцептор</h2>
    <p>В результате взаимодействий объект может терять внутренние части или приобретать новые. Если действия объекта
        направлены на присоединение новых частей или сохранение собственных, он действует как акцептор. Если в
        результате действий объект теряет свои части или не использует возможность присоединить новые, то он действует
        как донор. Производными противоположностями являются: «создание — разрушение», «жизнь — смерть».</p>

    <p>Объекты низкого уровня также могут проявлять свойства акцептора или донора. Например, положительно заряженный ион
        (катион) действует как акцептор, присоединяя к себе электроны. Отрицательно заряженный ион (анион) образуется
        после отрыва электрона от нейтрального донора.</p>

    <p>Про акцепторные действия людей часто говорят: эгоизм, хищничество, агрессия. Про действия доноров: альтруизм,
        бескорыстность, честность. Также акцепторные действия чаще всего соответствуют материальному, а донорские —
        духовному.</p>

    <h2>Иерархия — Анархия</h2>
    <p>Противоположность «иерархия — анархия» является характеристикой внутреннего устройства объекта и зависит от силы
        и количества управляющих элементов. Иерархия возникает при наличии сильных управляющих элементов. При отсутствии
        контроля части действуют самостоятельно, создавая анархию.</p>

    <p>«Иерархия — анархия» часто пересекается с противоположностью «свобода — несвобода». Иерархическое устройство
        всего объекта осуществляется за счет ограничения свободы его частей.</p>

    <p>Иерархия и анархия ярко проявляются в устройстве объектов-социумов. Аристотель характеризовал политический строй
        государства в зависимости от системы управления:</p>

    <p>
        Монархия (тирания) — один сильный управляющий элемент.<br>
        Аристократия (олигархия) — группа менее сильных управляющих элементов.<br>
        Полития (демократия) — отсутствие сильных управляющих элементов.<br>
    </p>

    <p>Чрезмерная анархия в государстве приводит к возвышению сильных частей над слабыми в процессе конкуренции. Это
        влечет за собой появление управляющих элементов, то есть, установление иерархии. Так в социумах естественным
        образом могут происходить колебания (глава 1.5) между иерархией и анархией.</p>

    <blockquote>Анархия — мать порядка.<br>— Пьер Жозеф Прудон</blockquote>

    <p>Во времена Великой Французской Революции левые политические движения олицетворяли стремление к свободе и
        равенству, тогда как правые — возврат к естественной иерархии. Может показаться, что левые связаны со свободой,
        а правые с несвободой, однако к правым движениям также относят анархизм и разные формы либерализма. Подобные
        политологические термины весьма запутаны, а также могут отличаться для различных объектов-социумов.</p>

    <h2>Другие противоположности</h2>
    <p>Существует множество других противоположностей, которые порождаются физическими или геометрическими свойствами
        объектов: «холодное — горячее», «светлое — темное», «тупое — острое», «пустое — полное», «высокое — низкое» и
        многие другие.</p>

    <p>В психологии принята пятифакторная модель личности, которая включает в себя противоположности: экстраверсия —
        интроверсия, привязанность — отделенность, импульсивность — контроль, эмоциональность — спокойствие, открытость
        новому — практичность.</p>

    <h2>Итог</h2>
    <p>Резюмируя, можно сказать, что двумя основными противоположностями являются «внешнее — внутреннее» и «общее —
        частное». По мере увеличения сложности у объектов появляется возможность получать и преобразовывать информацию,
        что приводит к появлению противоположности «теория — практика».</p>

    <p>Следующее изображение наглядно показывает основные противоположности.</p>
    <br><br>
    <img alt="" src="/images/3.1-1.jpg">
</main>