<?php include __DIR__ . "/header.php" ?>

<main>
    <p>Необходимо обратить внимание на две похожих противоположности: «часть — целое» и «частное — общее». Разберемся,
        чем они отличаются.</p>

    <p>По определению, каждый объект представляет собой множество частей, объединенных связями. В контексте одного
        объекта речь идет о противоположности «часть — целое».</p>

    <p>Также можно говорить об общих свойствах несвязанных объектов. Например, коробка для обуви, холодильник и
        контейнер для грузоперевозки имеют общее свойство — форму прямоугольного параллелепипеда, но при этом не имеют
        явных связей. В этом случае речь идет о противоположности «частное — общее».</p>

    <p>В случае объектов, состоящих из однотипных частей, например, социумов, эти противоположности могут совпадать.</p>

    <p>Далее в примерах в основном говорится о первом случае — конкретном объекте и противоположности «часть — целое».
        При этом вместо слова «целое» очень часто будет употребляться «общее». Мы заранее обращаем внимание читателя на
        эту терминологическую путаницу.</p>

    <h3>Объект: человек</h3>
    <p>В организме человека можно выделить много общих и частных свойств. Например, вес — общая характеристика, вклад в
        которую вносят все внутренние части, а объем мозга или цвет глаз — частные.</p>

    <h3>Объект: армия</h3>
    <p>Долгосрочный план действия всей армии как единого целого называется стратегией. Действия отдельных частей:
        батальонов, рот, взводов — тактикой.</p>

    <h3>Объект: государство</h3>
    <p>В государстве средняя зарплата по стране является общей статистической характеристикой, а зарплата конкретного
        человека — частной.</p>

    <p>Изучая некоторый объект, можно получать как информацию о его общем устройстве, так и о какой-то части. Нужно
        отметить, что общий взгляд не обязательно затрагивает абсолютно все внутренние части. Можно рассматривать
        какую-то крупную часть объекта или связи между разными частями.</p>

    <h3>Объект: автомобиль</h3>
    <p>Рядовой автолюбитель имеет общее представление об устройстве автомобиля: двигателя, системы зажигания, топливной
        системы, но вряд ли способен подробно рассказать о принципе работы датчика Холла. Однако такие частные знания
        необходимы работнику автосервиса.</p>

    <p>В качестве объекта можно рассмотреть некоторую область связанных знаний.</p>

    <h3>Объект: организм человека</h3>
    <p>Любой студент медицинского вуза обязан получить общие знания об организме человека. После этого он может
        углубиться в какую-либо специальную область — стать инфекционистом, хирургом, стоматологом и т. д.</p>

    <p>Отсутствие общей информации может вызывать дискомфорт. Например, рядовой исполнитель выполняет только ту часть
        работы, которая затрагивает зону его ответственности, но не видит, как работает вся система в целом. Это может
        затруднить понимание некоторых задач. Напротив, директор знает, как работает вся система, но не обязан
        разбираться в детальном устройстве каждой ее части.</p>

    <p>С другой стороны, общее видение объема предстоящей работы может вызывать тревогу, например, большой размер книги.
        Если же разбить ее на несколько небольших томов, то это знание перестанет беспокоить. Похожий способ разделения
        целого на части применяется при решении задач. Время выполнения объемной задачи легче оценить, если разбить ее
        на несколько мелких подзадач. Такой переход от целого к частному называется декомпозицией.</p>

    <blockquote>Декомпозиция — операция мышления, состоящая в разделении целого на части.<br>— Википедия</blockquote>

    <h2>Конфликт общего и частного</h2>
    <p>Соблюдение интересов всего объекта осуществляется с помощью управляющих элементов, которые ограничивают свободу
        внутренних частей. В этих случаях «часть — целое» пересекается с противоположностью «свобода — несвобода».</p>

    <h3>Клетка — организм</h3>
    <p>Управляющие элементы иммунной системы подавляют рост раковых клеток. Если этот механизм нарушен, клетки опухоли
        начинают бесконтрольно размножаться, создавая угрозу для всего организма.</p>

    <p>Наиболее известным конфликтом между общим и частным, пожалуй, является конфликт государства и человека.</p>

    <h3>Человек — государство</h3>
    <p>Обязательный призыв в армию — требование всего объекта от своих частей, которое реализуется с помощью управляющих
        элементов — военных комиссариатов.</p>

    <p>Отношения государства и гражданина изучаются философами и политологами с момента появления первых
        объектов-социумов.</p>
</main>
