<?php include __DIR__ . "/header.php" ?>

<main>
    <p>Противоположность «теория — практика» порождается способностью объектов преобразовывать информацию. Теория — это
        информация, хранящаяся в связях объектов. В качестве практики могут выступать как внутренние действия самого
        объекта, так и устройство внешних объектов.</p>

    <p>Например, когда отец учит сына забивать молотком гвозди, он предоставляет информацию, на основании которой
        совершаются действия. Процесс превращения теории в практику не всегда проходит по плану: прежде, чем мальчик
        научится забивать гвозди, он совершит множество неудачных попыток.</p>

    <blockquote>Пока речь идет об абстракциях — он силен, а вот как жизнь-матушка подопрет...<br>
        — Аркадий и Борис Стругацкие, «За миллиард лет до конца света»</blockquote>

    <p>Особое внимание в наших примерах уделим несоответствию теории и практики.</p>

    <h3>Объект: клетка</h3>
    <p>Используя последовательность нуклеотидов из ДНК как теоретическую информацию, клетка синтезирует белки. В
        процессе синтеза могут происходить ошибки и получившийся белок будет содержать мутации.</p>

    <h3>Объект: человек</h3>
    <p>При трудоустройстве на новую работу составляется трудовой договор — теоретические соглашения о взаимодействии
        компании и работника. В случае конфликта интересов, чтобы реализовать свои права на практике придется обратиться
        в суд.</p>

    <h3>Объект: человек</h3>
    <p>Выход нового фильма в кинопрокат сопровождается рекламной кампанией, которая формирует у зрителей теоретические
        ожидания. Слишком хвалебные отзывы критиков создают завышенные ожидания, что может негативно сказаться на
        рейтингах в дальнейшем.</p>

    <h3>Объект: государство</h3>
    <p>Принимая новый закон, правительство вносит изменения в административный или уголовный кодексы. Чтобы закон
        заработал на практике, требуются определенные условия. В связи с этим законодательным органам следует
        предусмотреть, как будет реализовано практическое применение закона.</p>

    <blockquote>Создавайте лишь немного законов, но следите за тем, чтобы они соблюдались.<br>
        — Джон Локк</blockquote>

    <p>В процессе конкуренции объекты высокого уровня могут манипулировать информацией, создавая о себе ложные
        представления.</p>

    <h3>Объект: животное</h3>
    <p>Способность животных передавать ложную информацию называют мимикрией. Например, некоторые виды бабочек своими
        движениями изображают пауков, что позволяет защищаться от хищников.</p>

    <h3>Объект: политик</h3>
    <p>Политики в своих предвыборных выступлениях говорят о совершении некоторых действий в будущем. Многие подобные
        обещания не исполняются, а некоторые являются невыполнимыми в принципе.</p>

    <blockquote>Человек ценен, когда его слова совпадают с его действиями.<br>
        — Оскар Уайльд</blockquote>

    <h3>Объект: игрок в покер</h3>
    <p>Своим поведением игроки в покер демонстрируют силу карт. Если эта информация не соответствует действительности,
        то мы имеем дело с обманным приемом, который называют блефом. С помощью подобных манипуляций можно оказывать
        давление на противников и даже выиграть, имея более слабые карты.</p>

    <h3>Объект: государство</h3>
    <p>Государство с помощью вбросов ложной информации пытается дезинформировать разведку противника и ввести его в
        заблуждение.</p>

    <p>Говоря о взаимодействиях объектов высокого уровня во второй части, мы видели, что теория и практика чередуют друг
        друга. Направленные воздействия приводят к получению новой информации, на основании которой вновь совершаются
        действия.</p>

    <h3>Объект: водитель</h3>
    <p>Двигаясь по незнакомой местности, водитель получает информацию о видимом участке дороги. Затем он совершает
        действия, чтобы направить автомобиль по нужному пути. После этого он получает информацию о следующем участке и
        процесс повторяется заново.</p>

    <p>Внутри объектов-социумов непрерывно происходит превращение теории и практики друг в друга.</p>

    <h3>Объект: животное</h3>
    <p>Наблюдая за другими особями, животные учатся определенным навыкам. Применяя их, они передают информацию следующим
        поколениям. Так теоретическая информация превращается в практические действия и наоборот.</p>

    <p>Противоположность «теория — практика» встречается во многих прикладных областях.</p>

    <h3>Объект: здание</h3>
    <p>Проект здания представляет собой информацию, которую создают проектировщики. На основании ее строители совершают
        действия, которые превращают теоретическую модель в готовую постройку.</p>

    <h3>Объект: объект в программировании</h3>
    <p>В объектно-ориентированном программировании классы являются теоретической моделью. На основании классов создаются
        конкретные объекты, которые являются их практической реализацией.</p>

    <p>Противоположность «теория — практика» похожа на основной вопрос философии о материи и сознании.</p>

    <blockquote>Великий основной вопрос всей, в особенности новейшей, философии есть вопрос об отношении мышления к бытию.<br>
        — Ф. Энгельс</blockquote>

    <p>Рассмотрев процессы получения и преобразования информации, можно сказать, что первичным все же является
        устройство объектов: внутренние части и связи. Умение получать и преобразовывать информацию появляется лишь у
        объектов высокого уровня.</p>
</main>
