<?php include __DIR__ . "/header.php" ?>

<main>
    <p>Свобода и несвобода возникают из способности объектов формировать и использовать множество действий. Чем больше у
        объекта вариантов действий, тем больше у него свободы.</p>

    <p>Наглядным примером максимальной несвободы может служить шахматная позиция, в которой за белых возможен
        единственный ход:</p>
    <img alt="" src="/images/3.4-1.jpg" height="300">

    <p>Существует два типа ограничений свободы.</p>

    <p>Ограничения первого типа заложены в самой природе пространства, которая делает некоторые действия невозможными.
        Например, выбирая маршрут из одной точки в другую, человек не рассматривает пути, проходящие насквозь через
        здания; в шахматном пространстве нельзя делать ходы, противоречащие правилам; в торговом — продать товар за цену
        большую, чем количество денег у покупателя.</p>

    <p>Ограничения второго типа возникают, когда объект анализирует множество действий и отбрасывает невыгодные
        варианты. Выбирая маршрут в темное время суток, человек старается избегать плохо освещенной местности; в
        шахматах игроки пытаются не делать ходов, приводящих к материальным потерям; в торговле продавец не станет
        заключать сделку по невыгодной цене.</p>

    <p>Что же лучше, свобода или несвобода? Обычно столь общие вопросы не имеют смысла, поскольку все зависит от свойств
        объекта и окружающего его внешнего пространства. Например, предоставляя школьнику полную свободу действий, можно
        получить весьма различные результаты. Если ребенок проявляет интерес к обучению, то он самостоятельно закончит
        школу и поступит в институт. Но есть вероятность, что подросток свяжется с плохой компанией, обзаведется
        вредными привычками и бросит учебу. Ограничения позволяют направить развитие объекта по нужному пути, поэтому
        хорошо работают на начальном этапе роста.</p>

    <p>В концепции японских боевых искусств Сю-Ха-Ри существуют три степени ограничения свободы, которые ослабляются по
        мере получения опыта.</p>

    <blockquote>
        Сю (соблюдать) — первая ступень, означающая, что надо заучивать всё точно так, как показывает
        учитель.<br>
        Ха (прорываться) — вторая ступень, на которой ученик обдумывает свои действия, изменяет
        правила, пробует их нарушать, строит новую систему своих собственных правил.<br>
        Ри (отделяться) — третья ступень, согласно которой нужно освободиться от правил.<br>
        — Википедия
    </blockquote>

    <p>Иногда, для достижения максимальной эффективности, необходимо принимать решения в зависимости от обстоятельств.
        Ограничения лишают такой гибкости, что может являться минусом.</p>

    <h3>Объект: игрок</h3>
    <p>В командных играх жесткие схемы ограничивают свободу каждого игрока, но позволяют команде действовать слаженно.
        Такой подход хорош для молодых неопытных команд, однако в игре может возникнуть ситуация, когда игроку лучше
        отклониться от плана и действовать самостоятельно.</p>

    <h3>Объекты: сотрудники компании</h3>
    <p>Отсутствие контроля за работой сотрудников снижает эффективность производства. С другой стороны, чрезмерные
        ограничения могут спровоцировать потерю мотивации, особенно у работников творческих профессий.</p>

    <blockquote>
        Лучшие люди руководят собой сами — нет нужды управлять ими.<br>
        — Стив Джобс
    </blockquote>

    <p>Запреты позволяют избежать нежелательных действий, поэтому иногда синонимом несвободы является безопасность.</p>

    <blockquote>
        Единственное средство избавить человека от преступлений — это избавить его от свободы.<br>
        — Замятин, «Мы»
    </blockquote>

    <h3>Объект: гражданин</h3>
    <p>Чрезмерная свобода в оформлении документов может позволить мошенникам совершать противоправные действия. С другой
        стороны, избыточная бюрократия приводит к дополнительным издержкам и неэффективности.</p>

    <p>Разные вещи дают разную свободу их использования.</p>

    <h3>Объект: именинник</h3>
    <p>Рассмотрим три варианта подарка на день рождения: деньги, подарочный сертификат в магазин и конкретный подарок. В
        перечисленном порядке уменьшается свобода использования подарка. Деньги дают имениннику максимальную свободу
        использовать их так, как он считает нужным. В этом случае дарящий прилагает минимум усилий по выбору подарка.
        Подарочный сертификат ограничивает область применения, но оставляет возможность выбора. Конкретная вещь
        полностью лишает именинника свободы и переносит ответственность на дарящего.</p>

    <p>Точно также разная информация оставляет разную степень свободы для ее преобразования.</p>

    <h3>Объект: читатель/зритель</h3>
    <p>Литературные произведения и кино накладывают на воображение человека разные ограничения. Читая книгу, мы более
        свободны в представлении героев и их окружения. В кино вся информация фиксируется в виде внешности, актерской
        игры, декораций и прочего.</p>

    <p>В зависимости от типа ограничений «свобода — несвобода» порождает другие противоположности.</p>

    <h2>Порядок — Хаос</h2>

    <p>Порядок возникает при применении ограничений к группе объектов одного типа. Под действием внешней силы объекты
        начинают действовать схожим образом. При отсутствии ограничений каждый объект действует индивидуально, создавая
        хаос.</p>

    <h3>Объекты: тела</h3>
    <p>Земля оказывает воздействие на все тела нашей планеты. В этом смысле мы все рождаемся и живем несвободными.</p>

    <h3>Объекты: атомы</h3>
    <p>Атомы ферромагнетиков под воздействием внешнего магнитного поля принимают одинаковое положение.</p>

    <h3>Объекты: солдаты</h3>
    <p>Приказ командира группе солдат заставляет их единообразно совершать некоторые действия.</p>

    <p>Проблемой ограничений для группы является обстоятельство, что зачастую нет возможности ввести их
        дифференцированно. Например, нельзя ввести ограничение скорости 60 км/ч для неаккуратных водителей и 80 км/ч для
        аккуратных. Значит, для некоторой группы водителей будут введены либо избыточные ограничения, либо
        недостаточные. В подобных случаях следует искать баланс, в котором свобода и несвобода сочетаются в наиболее
        выгодной пропорции.</p>

    <p>Противоположность «порядок — хаос» встречается в некоторых религиях, например, в древнеегипетской мифологии
        порядок и хаос олицетворяют сущности Маат и Исфет соответственно.</p>

    <h2>Творчество — Копирование</h2>

    <p>Если объект ограничен в своих действиях некоторым шаблоном, то речь идет о копировании; если же объекту
        предоставлена свобода комбинировать различные элементы, создавая нечто новое, — это называется творчеством.</p>

    <h3>Объект: клетка</h3>
    <p>Рекомбинация генов является проявлением творчества, поскольку из набора старых генов образуется организм,
        обладающий новыми свойствами. Процесс репликации в клетке — копирование уже имеющейся молекулы ДНК.</p>

    <h3>Объект: человек</h3>
    <p>При решении простых математических задач, используются известные теоремы. Если же задача олимпиадная, стандартные
        методы не подходят, требуется творческий подход.</p>

    <p>Проявлением творчества человека также являются: сочинение стихов, рисование, создание музыки. При этом многие
        творческие процессы не являются полностью свободными и имеют определенные ограничения. При сочинении стихов
        необходимо соблюдать рифму, создание музыки требует нотной грамотности, а рисование с натуры — повторения форм
        реальных объектов. В отличие от рисования с натуры абстракционизм — более свободный вид творчества.</p>

    <h2>Логика — интуиция</h2>

    <p>Противоположность «логика — интуиция» возникает при применении логических ограничений к процессу преобразования
        информации. Информация, полученная с помощью логики должна достоверно описывать реальные объекты и их
        взаимодействия. Более свободным способом получения информации является интуиция, которая использует вольные
        интерпретации, предсказания, догадки. Минусом интуиции является низкое качество получаемой информации, но при
        этом она позволяет добраться в те области, где отсутствует точное знание. Не стоит считать интуицию применимой
        исключительно в религии или эзотерике. Многие научные гипотезы были выдвинуты благодаря нестандартному мышлению,
        выходящему за пределы строгой логики.</p>

    <blockquote>
        Вы должны быть всегда готовы к тому, чтобы отказаться от всего того, во что вы до сих пор крепко верили, чем
        увлекались, в чем полагали гордость вашей мысли, и даже не стесняться теми истинами, которые, казалось бы, уже
        навсегда установлены наукой. Действительность велика, беспредельна, бесконечна и разнообразна, она никогда не
        укладывается в рамки наших признанных понятий, наших самых последних знаний… Без абсолютной свободы мысли нельзя
        увидеть ничего истинно нового, что не являлось бы прямым выводом из того, что вам уже известно.<br>
        — Павлов, «Об уме вообще, о русском уме в частности»
    </blockquote>
</main>