<?php include __DIR__ . "/header.php" ?>

<main>
    <p>До этого момента мы говорили преимущественно о высокоорганизованных объектах: клетках, организмах, социумах.
        Пришло время спуститься на самый низкий уровень и поразмышлять об элементарных объектах, из которых состоит
        остальная материя.</p>

    <h2>Материя и пространство</h2>

    <p>Для начала необходимо отказаться от привычного представления о координатах, скоростях и других физических
        свойствах. Мы привыкли рассматривать пространство как «пустой мешок», в котором происходит движение тел.
        Представим, что существуют лишь элементарные объекты, которые могут иметь связи и передавать друг другу
        изменения. Такие объекты будем называть «точками пространства» (в этой главе под словом «пространство»
        подразумевается множество элементарных объектов). Вопрос об их внутреннем устройстве остается открытым.
        Например, это могут быть объекты с бинарным состоянием 0 или 1.</p>

    <p>Теперь покажем, как из таких элементарных объектов можно получить более сложные. Изобразим на плоскости несколько
        точек пространства. Линиями обозначим связи между ними. Выберем группу точек и добавим им связей так, чтобы
        каждая была связана с каждой.</p>
    <img alt="" src="/images/4.1-1.jpg">

    <p>За счет дополнительных связей точки пространства образовали частицу. Таким образом, материя — это область
        пространства, в которой изменения передаются более интенсивно. Можно представить это наглядно в виде новогодней
        гирлянды, в которой группа лампочек начинает мигать быстрее остальных.</p>

    <h2>Движение и время</h2>

    <p>Как же происходит движение такого объекта? В результате взаимодействий разрываются связи между одними точками
        пространства и образуются между другими. Так объект изменяет свое положение. Скорость такого движения должна
        быть ограничена максимальным количеством изменений.</p>

    <p>Понятие «время» практически тождественно понятию «изменение». Течение привычного нам времени является
        последовательностью наблюдаемых изменений. Время не является абсолютным — изменения, происходящие с одним
        объектом, могут опережать или отставать от изменений других объектов.</p>

    <p>Если объект движется с максимальной скоростью, все его части «заняты» взаимодействиями с внешними точками
        пространства, и он «не успевает» совершать внутренние действия. Это приводит к тому, что время в собственной
        системе отсчета останавливается.</p>

    <p>В специальной теории относительности используется четырехмерное пространство, в котором время добавляется к
        классическим координатам. Такой подход вполне объясним с помощью нашей терминологии. Если взаимодействия объекта
        связаны с внешними точками пространства, это можно рассматривать как изменение пространственных координат. Если
        это внутренние взаимодействия, то это — течение времени в собственной системе отсчета.</p>

    <h2>Гравитация</h2>

    <p>Окружающие объект точки пространства могут образовать связи и стать внутренними частями. В то же время внутренние
        части могут потерять связи и стать внешними точками пространства.</p>
    <img alt="" src="/images/4.1-2.jpg">

    <p>Таким образом объекты «затягивают» свободное пространство в себя и одновременно с этим «высвобождают» новое.
        Вероятно, здесь мы наблюдаем известный гравитационный эффект — искривление пространства.</p>

    <h2>Квантовая механика</h2>

    <p>Квантовая теория говорит, что координаты, скорости и другие наблюдаемые величины не определены до момента
        измерения, а состояние описывается вектором или волновой функцией. После измерения объект принимает состояние с
        определенным значением наблюдаемой величины.</p>

    <p>В нашем случае состояние объекта характеризуется набором внутренних частей и связей. Неопределенность координат и
        скоростей не является чем-то удивительным, хотя бы потому, что пространство элементарных объектов представляет
        собой постоянно изменяющуюся структуру. Но, предположим, что каждой точке пространства удалось поставить в
        соответствие набор координат. Даже в этом случае существует некоторая неопределенность, поскольку объект может
        иметь связи с разными точками пространства.</p>
    <img alt="" src="/images/4.1-3.jpg">

    <p>Если в какой-то области объект встретит измерительный прибор, произойдет взаимодействие. Как известно из
        двухщелевого опыта или эксперимента с интерферометром Маха-Цендера, это вызовет разрыв с другими точками
        пространства и разрушение интерференционной картины.</p>

    <p>Похожим образом можно объяснить квантовую запутанность. Между запутанными частицами существуют связи, и измерение
        свойств одной частицы влияет на состояние второй.</p>
    <img alt="" src="/images/4.1-4.jpg">

    <h2>Заключение</h2>

    <p>Теория объектов подсказывает модель микромира, основанную на элементарных объектах и связях между ними. Чтобы
        превратить эту модель в конкретную гипотезу, необходимо предложить алгоритм передачи изменений между точками
        пространства, а также понять, как состояние внутренних частей и связей соотносится с наблюдаемыми физическими
        величинами.</p>
</main>
