<?php

/** @var array $data */

declare(strict_types=1);

/** @var array $chapters */
$chapters = $data['chapters'];

?>

<h1>Объекты</h1>

<main>
    <p>В книге «Объекты» ставится общий философский вопрос, который можно сформулировать так: «Есть ли что-то общее у
        вещей самой разной природы?». Предметом нашего исследования являются частицы, физические тела, клетки, животные,
        люди, социумы. Сначала мы познакомимся с общими принципами теории объектов, затем рассмотрим процесс
        взаимодействия и в заключение поговорим о противоположностях.</p>

    <p><a href="/chapter/1.1">Читать</a></p>
    <p><a href="/chapters">Оглавление</a></p>
</main>
