<?php

return [
    '1.1' => 'Определение объекта',
    '1.2' => 'Действия и внешние воздействия',
    '1.3' => 'Пространства',
    '1.4' => 'Управляющие элементы',
    '1.5' => 'Адаптация и колебания',

    '2.1' => 'Взаимодействие объектов',
    '2.2' => 'Получение информации',
    '2.3' => 'Преобразование информации',
    '2.4' => 'Действия',
    '2.5' => 'Направленные воздействия',
    '2.6' => 'Множество действий',
    '2.7' => 'Конкуренция',

    '3.1' => 'Основные противоположности',
    '3.2' => 'Часть — целое',
    '3.3' => 'Теория — практика',
    '3.4' => 'Свобода — несвобода',

    '4.1' => 'Объекты и физика',
];